{
  "id": "lesson_bai-2-tinh-toan-nhi-phan",
  "title": "lesson_bai-2-tinh-toan-nhi-phan",
  "body": "<h1>⚙️ BÀI 2 – TÍNH TOÁN NHỊ PHÂN</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu nguyên lý thực hiện các phép toán cộng, trừ, nhân, chia trong hệ nhị phân.</li><li>Thực hành tính toán thủ công và hiểu cơ chế ALU thực hiện phép toán.</li><li>Nắm vững khái niệm số chấm động, chuẩn IEEE 754 và cách chuẩn hóa số.</li><li>Phân biệt các dạng mã số khác như BCD, Gray, Excess-3.</li><li>Phân tích tràn, dấu, làm tròn và sai số trong các phép toán nhị phân.</li></ul><hr><h2>1. NGUYÊN LÝ TÍNH TOÁN TRONG NHỊ PHÂN</h2><p>Hệ nhị phân chỉ có hai ký hiệu 0 và 1 nên phép toán cơ bản dựa trên quy tắc cộng bit. Tất cả các phép cộng, trừ, nhân, chia đều quy về tổ hợp của các cổng logic cơ bản (AND, OR, XOR, NOT).</p><hr><h2>2. CÁC PHÉP TOÁN TRÊN NHỊ PHÂN</h2><h3>2.1 Phép cộng nhị phân</h3><table border=\"1\"><tbody><tr><th>A</th><th>B</th><th>Kết quả</th><th>Nhớ</th></tr><tr><td>0</td><td>0</td><td>0</td><td>0</td></tr><tr><td>0</td><td>1</td><td>1</td><td>0</td></tr><tr><td>1</td><td>0</td><td>1</td><td>0</td></tr><tr><td>1</td><td>1</td><td>0</td><td>1</td></tr></tbody></table><p>ALU thực hiện cộng bằng mạch <b>Full Adder</b>. Trong cộng bù 2, bit nhớ cuối cùng được bỏ qua.</p><h3>2.2 Phép trừ nhị phân</h3><p>Thực hiện bằng cách cộng số bị trừ với số bù 2 của số trừ. Ví dụ: 0101 – 0011 = 0101 + (1101) = 0010.</p><h3>2.3 Phép nhân nhị phân</h3><p>Giống phép nhân thập phân nhưng chỉ có nhân với 0 hoặc 1. Nhân nhị phân có thể thực hiện bằng phép dịch trái và cộng có điều kiện.</p><p>Ví dụ: 101 × 11 = (101 × 1) + (101 × 10) = 101 + 1010 = 1111.</p><h3>2.4 Phép chia nhị phân</h3><p>Tương tự phép chia dài trong thập phân. Thường được cài đặt bằng dịch trái và trừ tuần tự, lưu phần dư trong thanh ghi remainder.</p><hr><h2>3. SỐ DẤU CHẤM ĐỘNG (FLOATING POINT)</h2><h3>3.1 Khái niệm</h3><p>Số dấu chấm động cho phép biểu diễn giá trị rất lớn hoặc rất nhỏ bằng cách tách phần định trị (mantissa) và phần mũ (exponent). Dạng tổng quát: (−1)<sup>s</sup> × 1.m × 2<sup>e−bias</sup>.</p><h3>3.2 Chuẩn IEEE 754</h3><ul><li><b>Single precision (32 bit):</b> 1 bit dấu, 8 bit mũ (bias 127), 23 bit định trị.</li><li><b>Double precision (64 bit):</b> 1 bit dấu, 11 bit mũ (bias 1023), 52 bit định trị.</li></ul><h3>3.3 Chuẩn hóa và sai số</h3><p>Giá trị được chuẩn hóa sao cho bit đầu tiên của định trị là 1 (trừ số 0). Sai số tròn có thể là round-to-nearest-even hoặc truncation.</p><hr><h2>4. CÁC MÃ SỐ KHÁC</h2><h3>4.1 Mã BCD (Binary-Coded Decimal)</h3><p>Mỗi chữ số thập phân được biểu diễn bằng 4 bit. Ví dụ: 47<sub>10</sub> = 0100 0111 (BCD). Dùng trong hiển thị số trên LCD.</p><h3>4.2 Mã Excess-3</h3><p>Mỗi chữ số thập phân cộng thêm 3 trước khi mã hóa. Ví dụ: 5 → 1000. Ưu điểm: không có mã toàn 0, giảm lỗi truyền.</p><h3>4.3 Mã Gray</h3><p>Hai số liên tiếp chỉ khác nhau đúng 1 bit, giúp giảm nhiễu trong truyền tín hiệu số. Ví dụ: 3-bit Gray = 000,001,011,010,110,111,101,100.</p><hr><h2>5. DẤU CHẤM ĐỘNG VÀ DẤU CHẤM TĨNH</h2><ul><li><b>Fixed-point:</b> Dấu chấm cố định, đơn giản, dùng trong nhúng.</li><li><b>Floating-point:</b> Dấu chấm di động, dải biểu diễn rộng, dùng trong máy tính khoa học.</li></ul><hr><h2>6. TRÀN VÀ LÀM TRÒN</h2><p>Tràn xảy ra khi kết quả vượt phạm vi biểu diễn. Với số có dấu, tràn khi hai số cùng dấu cho kết quả khác dấu. Sai số làm tròn xảy ra do giới hạn bit định trị.</p><hr><h2>7. TỐI ƯU HÓA PHÉP TOÁN</h2><ul><li>Dịch trái tương ứng nhân 2, dịch phải tương ứng chia 2 (với số không dấu).</li><li>Trong CPU, phép cộng thực hiện nhanh hơn nhân hoặc chia, nên thuật toán thường thay thế nhân/chia bằng dịch bit.</li></ul><hr><h2>✅ TỔNG KẾT</h2><ul><li>Các phép toán nhị phân được cài đặt bằng cổng logic cơ bản.</li><li>Chuẩn IEEE 754 giúp biểu diễn chính xác số thực trong phần cứng.</li><li>Các mã số khác như BCD, Gray hỗ trợ truyền dữ liệu và hiển thị ổn định.</li></ul>",
  "updated_at": null
}