{
  "id": "lesson_bai-01-tong-quan-ve-cong-nghe-phan-mem",
  "title": "lesson_bai-01-tong-quan-ve-cong-nghe-phan-mem",
  "body": "<h1>🧩 BÀI 01 – TỔNG QUAN VỀ CÔNG NGHỆ PHẦN MỀM</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu khái niệm phần mềm, công nghệ phần mềm, và vai trò của kỹ sư phần mềm.</li><li>Nhận biết được các loại phần mềm và đặc điểm chất lượng của phần mềm tốt.</li><li>Nắm được quy trình phát triển phần mềm (SDLC) và các mô hình phát triển phổ biến.</li><li>Phân tích ưu – nhược điểm của từng mô hình phát triển như: Thác nước, Lặp, Xoắn ốc, Agile/Scrum.</li><li>Hiểu vai trò của tài liệu kỹ thuật và vòng đời sản phẩm phần mềm (Software Lifecycle).</li></ul><hr><h2>1. Khái niệm cơ bản</h2><ul><li><b>Phần mềm (Software):</b> tập hợp các chương trình, tài liệu và quy trình phục vụ cho việc vận hành hệ thống máy tính.</li><li><b>Công nghệ phần mềm (Software Engineering):</b> ngành kỹ thuật áp dụng nguyên tắc, phương pháp, và công cụ khoa học để phát triển và bảo trì phần mềm chất lượng cao.</li><li><b>Kỹ sư phần mềm (Software Engineer):</b> người chịu trách nhiệm phân tích, thiết kế, xây dựng, kiểm thử, bảo trì và quản lý dự án phần mềm.</li></ul><p><b>Ví dụ:</b> Một ứng dụng ngân hàng trực tuyến cần nhóm kỹ sư phát triển frontend, backend, cơ sở dữ liệu, kiểm thử, bảo mật, và DevOps phối hợp theo quy trình phần mềm chuẩn.</p><hr><h2>2. Các loại phần mềm</h2><ul><li><b>Phần mềm hệ thống (System Software):</b> như Windows, Linux, macOS.</li><li><b>Phần mềm ứng dụng (Application Software):</b> như Word, Chrome, Zalo, Photoshop.</li><li><b>Phần mềm nhúng (Embedded Software):</b> trong thiết bị IoT, máy giặt, ô tô thông minh.</li><li><b>Phần mềm trí tuệ nhân tạo (AI Software):</b> như ChatGPT, nhận dạng giọng nói, xử lý ngôn ngữ tự nhiên.</li></ul><hr><h2>3. Chất lượng phần mềm</h2><p>Phần mềm chất lượng cao cần đạt các tiêu chí sau:</p><ul><li><b>Tính chính xác (Correctness):</b> hoạt động đúng yêu cầu.</li><li><b>Tính tin cậy (Reliability):</b> ít lỗi, chạy ổn định trong thời gian dài.</li><li><b>Tính bảo trì (Maintainability):</b> dễ sửa đổi, cập nhật.</li><li><b>Tính hiệu quả (Efficiency):</b> sử dụng tối ưu tài nguyên.</li><li><b>Tính khả chuyển (Portability):</b> dễ chuyển sang môi trường khác.</li><li><b>Tính khả sử dụng (Usability):</b> thân thiện, dễ dùng.</li></ul><hr><h2>4. Quy trình phát triển phần mềm (Software Development Life Cycle – SDLC)</h2><p>Quy trình phát triển phần mềm gồm các giai đoạn chính:</p><ol><li>Khởi tạo (Initiation)</li><li>Phân tích yêu cầu (Requirement Analysis)</li><li>Thiết kế hệ thống (System Design)</li><li>Lập trình (Implementation)</li><li>Kiểm thử (Testing)</li><li>Triển khai (Deployment)</li><li>Bảo trì (Maintenance)</li></ol><p>➡️ Mục tiêu là đảm bảo mỗi giai đoạn có đầu ra (deliverable) cụ thể, dễ theo dõi và kiểm soát.</p><hr><h2>5. Các mô hình phát triển phần mềm</h2><h3>🔹 Mô hình Thác nước (Waterfall Model)</h3><p>Phát triển theo trình tự: Yêu cầu → Thiết kế → Cài đặt → Kiểm thử → Triển khai → Bảo trì.</p><p><b>Ưu điểm:</b> Dễ quản lý, rõ ràng từng giai đoạn.</p><p><b>Nhược điểm:</b> Khó thay đổi yêu cầu; chỉ phù hợp dự án nhỏ.</p><h3>🔹 Mô hình Lặp (Iterative Model)</h3><p>Phần mềm được phát triển qua nhiều vòng lặp, mỗi vòng lặp tạo ra bản hoàn chỉnh nhỏ (prototype).</p><h3>🔹 Mô hình Xoắn ốc (Spiral Model)</h3><p>Kết hợp giữa mô hình thác nước và lặp, tập trung vào đánh giá rủi ro mỗi vòng phát triển.</p><h3>🔹 Mô hình Agile/Scrum</h3><p>Phát triển linh hoạt, chia nhỏ dự án thành <b>sprint</b> ngắn (~2–4 tuần), liên tục phản hồi và cải tiến.</p><p><b>Vai trò chính trong Scrum:</b></p><ul><li>Product Owner – định nghĩa yêu cầu, ưu tiên backlog.</li><li>Scrum Master – đảm bảo quy trình Scrum đúng chuẩn.</li><li>Development Team – thực hiện nhiệm vụ kỹ thuật.</li></ul><hr><h2>6. So sánh các mô hình phát triển</h2><table border=\"1\" cellpadding=\"6\" cellspacing=\"0\"><thead><tr><th>Mô hình</th><th>Ưu điểm</th><th>Nhược điểm</th></tr></thead><tbody><tr><td>Waterfall</td><td>Rõ ràng, dễ quản lý</td><td>Không linh hoạt, khó thay đổi</td></tr><tr><td>Iterative</td><td>Dễ kiểm thử sớm, cải tiến từng bước</td><td>Quản lý phức tạp hơn</td></tr><tr><td>Spiral</td><td>Kiểm soát rủi ro tốt</td><td>Tốn chi phí, khó thực hiện</td></tr><tr><td>Agile/Scrum</td><td>Linh hoạt, tăng tương tác người dùng</td><td>Khó áp dụng cho dự án lớn thiếu tổ chức</td></tr></tbody></table><hr><h2>7. Tài liệu và vòng đời sản phẩm</h2><p>Trong mỗi giai đoạn cần tài liệu:</p><ul><li><b>SRS</b> – Đặc tả yêu cầu phần mềm</li><li><b>SDD</b> – Thiết kế chi tiết hệ thống</li><li><b>Test Plan</b> – Kế hoạch kiểm thử</li><li><b>User Manual</b> – Hướng dẫn sử dụng</li></ul><hr><h2>🧠 Bài tập thực hành</h2><ol><li>Phân tích quy trình phát triển cho ứng dụng học trực tuyến. Mô hình nào phù hợp nhất? Giải thích lý do.</li><li>Liệt kê các đặc tính phần mềm tốt theo ISO 9126.</li><li>So sánh ưu nhược điểm giữa mô hình Thác nước và Agile.</li><li>Vẽ sơ đồ SDLC và mô tả luồng thông tin giữa các giai đoạn.</li></ol><hr><h2>✅ Tổng kết</h2><ul><li>Công nghệ phần mềm là cầu nối giữa lập trình và quản lý dự án.</li><li>SDLC cung cấp khung chuẩn giúp kiểm soát chất lượng và tiến độ phát triển.</li><li>Hiểu mô hình phù hợp giúp tối ưu quy trình và giảm rủi ro trong dự án phần mềm thực tế.</li></ul>",
  "updated_at": null
}