{
  "id": "module_51",
  "lessons": [
    {
      "id": "lesson_bai-01-mo-dau-ve-quan-lu-du-an-cong-nghe-thong-tin",
      "title": "lesson_bai-01-mo-dau-ve-quan-lu-du-an-cong-nghe-thong-tin"
    },
    {
      "id": "lesson_bai-02-quan-lu-pham-vi-du-an",
      "title": "lesson_bai-02-quan-lu-pham-vi-du-an"
    },
    {
      "id": "lesson_bai-03-quan-lu-thoi-gian-du-an",
      "title": "lesson_bai-03-quan-lu-thoi-gian-du-an"
    },
    {
      "id": "lesson_bai-04-quan-lu-chi-phi-du-an",
      "title": "lesson_bai-04-quan-lu-chi-phi-du-an"
    },
    {
      "id": "lesson_bai-05-quan-lu-chat-luong-du-an",
      "title": "lesson_bai-05-quan-lu-chat-luong-du-an"
    },
    {
      "id": "lesson_bai-06-quan-lu-nguon-nhan-su-du-an",
      "title": "lesson_bai-06-quan-lu-nguon-nhan-su-du-an"
    },
    {
      "id": "lesson_bai-07-quan-lu-truyen-thong-du-an",
      "title": "lesson_bai-07-quan-lu-truyen-thong-du-an"
    },
    {
      "id": "lesson_bai-08-quan-lu-rui-ro-du-an",
      "title": "lesson_bai-08-quan-lu-rui-ro-du-an"
    },
    {
      "id": "lesson_bai-09-quan-lu-mua-sam-du-an",
      "title": "lesson_bai-09-quan-lu-mua-sam-du-an"
    },
    {
      "id": "lesson_bai-10-quan-lu-tich-hop-du-an",
      "title": "lesson_bai-10-quan-lu-tich-hop-du-an"
    }
  ],
  "quizzes": [
    {
      "file": "quiz_117.json",
      "question_count": 20,
      "questions": [
        "Khái niệm 'dự án' trong CNTT là gì?",
        "Ba yếu tố ràng buộc chính của một dự án là gì?",
        "Dự án CNTT khác dự án xây dựng ở điểm nào?",
        "Vai trò chính của nhà quản lý dự án CNTT là gì?",
        "Trong mô hình PMI, số lĩnh vực kiến thức chính là bao nhiêu?",
        "Mô hình Agile phù hợp nhất cho loại dự án nào?",
        "PMI là viết tắt của cụm từ nào?",
        "Giai đoạn nào trong vòng đời dự án tập trung bàn giao và đánh giá kết quả?",
        "Trong tam giác ràng buộc, nếu tăng phạm vi mà không tăng chi phí và thời gian, điều gì xảy ra?",
        "Công cụ nào KHÔNG phải phần mềm quản lý dự án?",
        "Phân tích: Dự án triển khai ERP thất bại do thay đổi yêu cầu khách hàng liên tục. Nguyên nhân chính là gì?",
        "Scrum thuộc nhóm phương pháp nào?",
        "Công cụ nào hỗ trợ theo dõi tiến độ dạng bảng Kanban?",
        "Các yếu tố thành công chính của dự án CNTT là gì?",
        "Giai đoạn đầu tiên của dự án CNTT là gì?",
        "Mục tiêu của giai đoạn 'Kiểm soát' trong quản lý dự án là gì?",
        "Khái niệm 'Hybrid Project Management' có nghĩa là gì?",
        "Trong dự án, stakeholder là ai?",
        "Trong mô hình Agile, 'Sprint' có ý nghĩa là gì?",
        "Đâu KHÔNG phải là nguyên nhân thất bại của dự án CNTT?"
      ]
    },
    {
      "file": "quiz_118.json",
      "question_count": 20,
      "questions": [
        "Phạm vi dự án được định nghĩa là gì?",
        "Mục tiêu chính của quản lý phạm vi là gì?",
        "Tài liệu nào mô tả chi tiết sản phẩm và giới hạn dự án?",
        "WBS là gì?",
        "WBS giúp ích cho hoạt động nào sau đây?",
        "Nếu khách hàng thêm tính năng mới sau khi đã ký hợp đồng, cần làm gì?",
        "Công cụ nào hỗ trợ vẽ WBS trực quan?",
        "Phân tích đoạn code:<pre><code>if (change_approved) { update(WBS); }</code></pre>Câu lệnh này biểu thị điều gì?",
        "WBS Dictionary dùng để làm gì?",
        "Ai chịu trách nhiệm phê duyệt thay đổi phạm vi?",
        "Nếu không có WBS, hậu quả nào có thể xảy ra?",
        "Scope Baseline gồm các thành phần nào?",
        "Công cụ nào KHÔNG dùng cho quản lý phạm vi?",
        "Khi phát hiện 'scope creep', bước đầu tiên cần làm là gì?",
        "WBS nên được phân rã đến cấp nào?",
        "WBS thường được biểu diễn dưới dạng nào?",
        "Phân biệt giữa 'Define Scope' và 'Validate Scope':",
        "Điều gì xảy ra nếu không kiểm soát thay đổi phạm vi?",
        "Scope Creep thường bắt nguồn từ đâu?",
        "Trong ví dụ WBS 'Phát triển Website', phần tử '1.3 Lập trình Backend' thuộc cấp độ nào?"
      ]
    },
    {
      "file": "quiz_119.json",
      "question_count": 20,
      "questions": [
        "Mục tiêu chính của quản lý thời gian là gì?",
        "Phương pháp CPM dùng để làm gì?",
        "Đường găng (Critical Path) là gì?",
        "Công thức tính Slack là gì?",
        "Trong PERT, thời gian trung bình được tính bằng công thức nào?",
        "Nếu SPI < 1, điều đó có nghĩa gì?",
        "Phương pháp nào cho phép thực hiện các công việc song song để rút ngắn tiến độ?",
        "Trong CPM, công việc nào có Slack = 0?",
        "Phân tích: Nếu công việc A (3 ngày) và B (4 ngày) đều phải hoàn thành trước C (3 ngày), tổng thời gian tối thiểu là?",
        "Loại phụ thuộc phổ biến nhất trong sơ đồ mạng là gì?",
        "Biểu đồ Gantt được dùng để:",
        "Nếu công việc có thời gian lạc quan = 4, trung bình = 6, bi quan = 10, thì thời gian PERT trung bình là:",
        "Kỹ thuật nào tăng tài nguyên để rút ngắn tiến độ?",
        "Khi một công việc trễ trên đường găng, điều gì xảy ra?",
        "Công cụ nào KHÔNG dùng để lập lịch dự án?",
        "Một dự án có 4 công việc với tổng thời gian 10 ngày. Nếu rút ngắn bằng Crashing thêm 2 nhân sự, tiến độ giảm 2 ngày, chi phí tăng 10%. Kết luận?",
        "SPI = EV / PV là chỉ số gì?",
        "Trong sơ đồ mạng, nếu một công việc có 2 tiền nhiệm, ES được tính như thế nào?",
        "Nếu công việc có Slack = 2, điều đó có nghĩa gì?",
        "Công việc nào KHÔNG nằm trên đường găng?"
      ]
    },
    {
      "file": "quiz_120.json",
      "question_count": 20,
      "questions": [
        "Chi phí trong dự án CNTT bao gồm các loại nào sau đây?",
        "Mục tiêu chính của quản lý chi phí dự án là gì?",
        "Phương pháp ước lượng nào dựa trên dữ liệu lịch sử dự án tương tự?",
        "Công thức tính ROI là gì?",
        "Khi NPV < 0, điều đó có nghĩa là gì?",
        "Trong EVM, chỉ số nào phản ánh hiệu suất chi phí?",
        "Công thức EAC (Estimate At Completion) là gì?",
        "Trong ví dụ: EV=40,000đ, AC=50,000đ, CPI=0.8 → điều này cho thấy gì?",
        "Khi CPI > 1, điều đó có nghĩa là gì?",
        "Phương pháp nào cộng dồn chi phí nhỏ từ WBS để ra chi phí tổng thể?",
        "Nếu EV = 200, PV = 250, SV = EV - PV = -50 → điều gì xảy ra?",
        "Thời gian hoàn vốn (Payback Period) cho biết điều gì?",
        "Phân tích: BAC=1 tỷ, CPI=0.8 → EAC=?",
        "Công thức CV (Cost Variance) là gì?",
        "Nếu CV < 0 thì:",
        "NPV được tính bằng công thức nào?",
        "Nếu NPV = 200 triệu và ROI = 20%, điều này cho thấy:",
        "Trong EVM, chỉ số nào dùng để đo tiến độ?",
        "Một dự án có EV=100, AC=90, PV=120 → CPI=?",
        "Khi chi phí vượt ngân sách, biện pháp phù hợp nhất là:"
      ]
    },
    {
      "file": "quiz_121.json",
      "question_count": 20,
      "questions": [
        "Chất lượng được định nghĩa là:",
        "Sự khác biệt giữa QA và QC là gì?",
        "Chu trình PDCA gồm những bước nào?",
        "ISO 9001 là gì?",
        "Six Sigma hướng tới mục tiêu gì?",
        "TQM là viết tắt của:",
        "Công cụ nào thể hiện mối quan hệ nguyên nhân – kết quả của vấn đề?",
        "Biểu đồ Pareto dựa trên nguyên tắc nào?",
        "Defect Density được tính bằng:",
        "Trong Six Sigma, mức 6σ tương ứng với bao nhiêu lỗi mỗi triệu cơ hội?",
        "Kiểm thử tích hợp (Integration Test) thuộc giai đoạn nào của kiểm thử phần mềm?",
        "Chỉ số nào thể hiện sự ổn định của quy trình trong Control Chart?",
        "Phân tích: Một dự án có Defect Rate = 0.002. Điều này có nghĩa là?",
        "Để cải tiến liên tục, mô hình nào được khuyến nghị?",
        "Trong QA, hoạt động nào sau đây KHÔNG thuộc phạm vi đảm bảo chất lượng?",
        "Trong CNTT, yếu tố nào KHÔNG thuộc đặc tính chất lượng phần mềm?",
        "Biểu đồ kiểm soát (Control Chart) dùng để:",
        "Khi phát hiện nhiều lỗi sau triển khai, nguyên nhân phổ biến là:",
        "ISO 9001 tập trung vào yếu tố nào?",
        "Trong QA checklist, mục 'Review Code Consistency' thuộc giai đoạn nào?"
      ]
    },
    {
      "file": "quiz_122.json",
      "question_count": 20,
      "questions": [
        "Quản lý nguồn nhân lực dự án là gì?",
        "Thuyết X của McGregor cho rằng:",
        "Giai đoạn 'Storming' trong mô hình Tuckman biểu thị điều gì?",
        "Theo Maslow, nhu cầu cao nhất của con người là:",
        "Thuyết hai yếu tố Herzberg chia thành:",
        "Khi nhóm đạt hiệu suất cao và tự vận hành, đó là giai đoạn nào trong Tuckman?",
        "Trong cấu trúc tổ chức nào PM có quyền cao nhất?",
        "Phong cách lãnh đạo nào phù hợp với nhóm có kinh nghiệm cao?",
        "PM dành khoảng bao nhiêu phần trăm thời gian cho giao tiếp?",
        "Trong mô hình Matrix, nhân viên có thể báo cáo cho:",
        "Yếu tố nào KHÔNG thuộc nhóm 'động lực' trong Herzberg?",
        "Cách xử lý xung đột 'Compromising' có nghĩa là:",
        "Trong lý thuyết McGregor, thuyết Y nhấn mạnh điều gì?",
        "Khi nhóm mới được hình thành, phong cách lãnh đạo nên là:",
        "Biện pháp hiệu quả nhất khi nhóm có xung đột lợi ích?",
        "Theo Herzberg, yếu tố nào giúp duy trì sự hài lòng nhưng không tạo động lực?",
        "Giai đoạn 'Norming' trong Tuckman biểu thị:",
        "Nếu PM quá chú trọng kỹ thuật mà bỏ qua giao tiếp nhóm, điều gì có thể xảy ra?",
        "Yếu tố nào quyết định sự thành công trong phát triển nhóm?",
        "Khi nhóm đạt giai đoạn Performing, vai trò của PM là:"
      ]
    },
    {
      "file": "quiz_123.json",
      "question_count": 20,
      "questions": [
        "Truyền thông dự án được hiểu là gì?",
        "Theo PMBOK, có mấy quy trình quản lý truyền thông?",
        "Trong mô hình truyền thông, yếu tố nào gây sai lệch thông điệp?",
        "Công thức tính số kênh giao tiếp giữa n người là:",
        "Nếu nhóm có 6 thành viên, có bao nhiêu kênh giao tiếp?",
        "Loại truyền thông nào phù hợp để gửi báo cáo định kỳ?",
        "Loại truyền thông nào phù hợp cho họp trực tuyến?",
        "Công cụ nào KHÔNG phải phần mềm hỗ trợ truyền thông dự án?",
        "Trong Communication Plan, cột 'Tần suất' thể hiện điều gì?",
        "Phương pháp giao tiếp 'Pull' thường được dùng khi:",
        "Trong sơ đồ truyền thông, phản hồi (Feedback) giúp:",
        "Một dự án CNTT có khách hàng nước ngoài, nên chú trọng yếu tố nào trong truyền thông?",
        "Khi số lượng thành viên tăng, điều gì xảy ra với kênh giao tiếp?",
        "Trong tình huống khách hàng không nhận được báo cáo tiến độ, nguyên nhân phổ biến là:",
        "Communication Matrix dùng để:",
        "Phương pháp nào giúp kiểm tra hiệu quả truyền thông?",
        "PM nên làm gì khi phát hiện thông tin bị nhiễu trong nhóm?",
        "Báo cáo tiến độ dạng biểu đồ Gantt thể hiện:",
        "Kỹ năng quan trọng nhất để truyền thông hiệu quả là:",
        "Khi một thành viên gửi sai thông tin kỹ thuật cho khách hàng, PM nên:"
      ]
    },
    {
      "file": "quiz_124.json",
      "question_count": 20,
      "questions": [
        "Rủi ro trong dự án được định nghĩa là gì?",
        "Rủi ro tích cực được gọi là gì?",
        "Theo PMBOK, bước đầu tiên trong quản lý rủi ro là gì?",
        "Công cụ nào giúp phân tích rủi ro theo xác suất và tác động?",
        "Nếu xác suất = 0.5 và tác động = 0.8, mức độ rủi ro là bao nhiêu?",
        "Khi rủi ro có P×I > 0.4, điều đó nghĩa là:",
        "Chiến lược 'Avoid' nghĩa là gì?",
        "Chiến lược 'Transfer' phù hợp trong trường hợp nào?",
        "Rủi ro mất nhân sự chủ chốt thuộc loại nào?",
        "Chiến lược 'Mitigate' có nghĩa là:",
        "Công cụ nào KHÔNG dùng để nhận dạng rủi ro?",
        "Tài liệu ghi lại toàn bộ rủi ro, chiến lược và trạng thái được gọi là:",
        "Trong rủi ro tích cực, chiến lược 'Exploit' nghĩa là:",
        "Kỹ thuật Delphi được dùng để:",
        "Risk Trigger là gì?",
        "Nếu một rủi ro có khả năng thấp nhưng tác động rất cao, nên:",
        "Rủi ro thay đổi yêu cầu (scope creep) thường được xử lý bằng cách:",
        "Rủi ro có thể mang lại lợi ích cho dự án thuộc loại:",
        "Nếu PM không cập nhật Risk Register thường xuyên, hậu quả có thể là:",
        "Ví dụ nào sau đây thể hiện chiến lược Mitigate?"
      ]
    },
    {
      "file": "quiz_125.json",
      "question_count": 20,
      "questions": [
        "Mục tiêu chính của quản lý mua sắm là gì?",
        "Theo PMBOK, có mấy quy trình quản lý mua sắm?",
        "Tài liệu nào mô tả yêu cầu kỹ thuật chi tiết và phạm vi công việc?",
        "Hợp đồng Fixed Price có đặc điểm gì?",
        "Hợp đồng T&M phù hợp với dự án nào?",
        "Trong hợp đồng Cost Plus, chi phí được tính thế nào?",
        "Tài liệu RFP dùng để:",
        "Yếu tố nào KHÔNG thuộc quy trình đấu thầu?",
        "Nguyên tắc cốt lõi trong quản lý mua sắm là:",
        "Tài liệu nào ghi nhận toàn bộ lịch sử giao dịch với nhà cung cấp?",
        "PM cần làm gì khi nhà thầu chậm tiến độ nhưng không thông báo?",
        "Rủi ro lớn nhất trong hợp đồng Cost-Reimbursable là:",
        "Trong RFP, phần 'Evaluation Criteria' dùng để:",
        "Trong dự án CNTT, hợp đồng thuê Cloud thuộc loại nào?",
        "Khi nhà cung cấp không đáp ứng KPI trong SLA, PM nên:",
        "Điều khoản SLA quy định:",
        "Trong quá trình kiểm soát mua sắm, hoạt động nào quan trọng nhất?",
        "Công cụ nào thường được sử dụng để quản lý mua sắm trong dự án lớn?",
        "Khi nhà cung cấp không giao hàng đúng hạn, biện pháp tốt nhất là:",
        "Khi kết thúc hợp đồng, PM cần làm gì?"
      ]
    },
    {
      "file": "quiz_126.json",
      "question_count": 20,
      "questions": [
        "Quản lý tích hợp dự án là gì?",
        "Tài liệu nào phê duyệt chính thức cho phép khởi động dự án?",
        "Ai có quyền phê duyệt Project Charter?",
        "Project Management Plan bao gồm:",
        "Change Control Board (CCB) có nhiệm vụ gì?",
        "Bước đầu tiên khi có yêu cầu thay đổi là:",
        "Khi một thay đổi được duyệt, PM cần:",
        "Quản lý tri thức dự án giúp:",
        "Tài liệu nào liệt kê bài học kinh nghiệm sau khi kết thúc dự án?",
        "Trong quy trình Change Control, ai chịu trách nhiệm phân tích tác động thay đổi?",
        "Tại sao quản lý tích hợp được xem là trọng tâm trong quản lý dự án?",
        "Khi nào PM nên tổ chức Lessons Learned Meeting?",
        "Project Integration giúp đảm bảo điều gì?",
        "Ví dụ nào thể hiện đúng quy trình Change Control?",
        "Nếu khách hàng yêu cầu thêm tính năng mà không thông qua CCB, PM nên:",
        "Project Closure bao gồm hoạt động nào?",
        "Công cụ hỗ trợ quản lý thay đổi phổ biến trong dự án CNTT là:",
        "Nếu nhiều thay đổi nhỏ liên tục được thực hiện mà không đánh giá tác động, nguy cơ là:",
        "Quản lý tri thức giúp tổ chức đạt điều gì lâu dài?",
        "Một dự án kết thúc thành công khi:"
      ]
    }
  ],
  "quiz_submissions": [
    {
      "file_cleaned": "submissions/cleaned_quiz_117_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_118_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_119_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_120_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_121_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_122_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_123_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_124_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_125_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    },
    {
      "file_cleaned": "submissions/cleaned_quiz_126_submissions.json",
      "count": 0,
      "average_score": 0,
      "top_5_students": []
    }
  ]
}