{
  "id": "lesson_bai-02-cong-cu-chrome-devtools",
  "title": "lesson_bai-02-cong-cu-chrome-devtools",
  "body": "<h1>🧩 BÀI 02 – CÔNG CỤ CHROME DEVTOOLS</h1>\n\n<h2>🎯 Mục tiêu học tập</h2>\n<ul>\n <li>Hiểu rõ vai trò và chức năng của Chrome DevTools trong phát triển ứng dụng web.</li>\n <li>Nhận biết các khung công cụ chính (Elements, Console, Network, Sources, Performance,...).</li>\n <li>Thực hành chỉnh sửa trực tiếp HTML/CSS, phân tích hiệu suất, debug mã JavaScript.</li>\n <li>Biết cách theo dõi request/response, cache và lỗi mạng.</li>\n <li>Sử dụng phím tắt và kỹ thuật nâng cao để tăng hiệu suất làm việc.</li>\n</ul>\n<hr>\n\n<h2>1. Giới thiệu chung</h2>\n<p><b>Chrome DevTools</b> là bộ công cụ mạnh mẽ tích hợp sẵn trong trình duyệt Google Chrome, cho phép lập trình viên web kiểm tra, phân tích và tối ưu mã nguồn HTML, CSS, JavaScript cũng như hiệu suất tải trang.</p>\n<p><b>Cách mở DevTools:</b></p>\n<ul>\n <li>Phím tắt: <code>F12</code> hoặc <code>Ctrl + Shift + I</code> (Windows) / <code>Cmd + Opt + I</code> (macOS)</li>\n <li>Hoặc chuột phải → Inspect</li>\n</ul>\n<hr>\n\n<h2>2. Cấu trúc và thành phần chính</h2>\n<ul>\n <li><b>Elements:</b> Hiển thị cấu trúc DOM và CSS của trang. Có thể chỉnh sửa trực tiếp HTML/CSS và quan sát thay đổi tức thì.</li>\n <li><b>Console:</b> Ghi log, hiển thị lỗi, chạy lệnh JavaScript trực tiếp.</li>\n <li><b>Network:</b> Phân tích các yêu cầu HTTP/HTTPS, kích thước file, cache và thời gian tải.</li>\n <li><b>Sources:</b> Xem, sửa và đặt breakpoint trong mã JavaScript.</li>\n <li><b>Performance:</b> Ghi lại quá trình render, layout và JavaScript execution để tối ưu tốc độ.</li>\n <li><b>Application:</b> Quản lý Local Storage, Session Storage, Cookies, Service Workers.</li>\n <li><b>Security:</b> Kiểm tra chứng chỉ HTTPS, Mixed Content và lỗi CSP.</li>\n</ul>\n<hr>\n\n<h2>3. Tab Elements – Kiểm tra và chỉnh sửa giao diện</h2>\n<p>Tab Elements cho phép xem cây DOM, thêm/xóa class, thuộc tính, hoặc thay đổi trực tiếp CSS để kiểm tra bố cục.</p>\n<pre><code>&lt;div class='container'&gt;\n &lt;h1&gt;Xin chào!&lt;/h1&gt;\n&lt;/div&gt;</code></pre>\n<p>Người học có thể chỉnh sửa trực tiếp thẻ <code>&lt;h1&gt;</code> để thay đổi nội dung mà không cần reload trang.</p>\n<hr>\n\n<h2>4. Tab Console – Debug và thực thi JavaScript</h2>\n<p>Console hỗ trợ nhập lệnh JS, kiểm tra giá trị biến, log dữ liệu.</p>\n<pre><code>let user = 'Admin';\nconsole.log('Xin chào ' + user);\n</code></pre>\n<p><b>Lỗi phổ biến:</b> ReferenceError, TypeError, SyntaxError hiển thị trực tiếp cùng số dòng.</p>\n<hr>\n\n<h2>5. Tab Network – Phân tích request và hiệu năng</h2>\n<p>Tab Network hiển thị tất cả request gửi đi từ trình duyệt: file HTML, JS, CSS, hình ảnh, API,...</p>\n<ul>\n <li>Cột <b>Name</b>: tên tài nguyên.</li>\n <li><b>Status</b>: mã HTTP (200, 404, 500,...).</li>\n <li><b>Type</b>: loại file (document, script, image,...).</li>\n <li><b>Waterfall</b>: thời gian tải từng request.</li>\n</ul>\n<p>Người học có thể lọc request theo loại (JS, CSS, Img, XHR) và xem header chi tiết.</p>\n<hr>\n\n<h2>6. Tab Sources – Debug JavaScript</h2>\n<p>Tab Sources cung cấp IDE nhỏ giúp đặt breakpoint, xem stack trace, theo dõi giá trị biến runtime.</p>\n<pre><code>function tinhTong(a, b) {\n return a + b;\n}\nconsole.log(tinhTong(5, 10));</code></pre>\n<p>Người học có thể đặt breakpoint tại dòng <code>return a + b;</code> để xem giá trị a, b khi chạy.</p>\n<hr>\n\n<h2>7. Tab Performance – Phân tích hiệu suất</h2>\n<p>Cho phép ghi lại và phân tích quá trình render trang: thời gian script, paint, layout. Giúp tối ưu khi trang bị chậm.</p>\n<p><b>Thực hành:</b> Mở Performance → Record → Thao tác trang → Stop → Phân tích biểu đồ.</p>\n<hr>\n\n<h2>8. Tab Application và Security</h2>\n<ul>\n <li><b>Application:</b> Xem dữ liệu lưu trữ (Local Storage, Session, Cookies,...)</li>\n <li><b>Security:</b> Kiểm tra chứng chỉ SSL, trạng thái HTTPS.</li>\n</ul>\n<hr>\n\n<h2>9. Phím tắt và mẹo hữu ích</h2>\n<ul>\n <li><code>Ctrl + Shift + C</code>: Chọn phần tử trên trang.</li>\n <li><code>Ctrl + /</code>: Comment nhanh trong Console.</li>\n <li><code>$0</code>: Truy cập phần tử hiện đang chọn trong Elements.</li>\n <li><code>Ctrl + P</code>: Tìm và mở nhanh file JS/CSS.</li>\n</ul>\n<hr>\n\n<h2>10. Tổng kết</h2>\n<ul>\n <li>Chrome DevTools là công cụ không thể thiếu trong kiểm thử, debug và tối ưu web.</li>\n <li>Giúp lập trình viên nắm rõ luồng hoạt động trình duyệt, tối ưu tốc độ và sửa lỗi nhanh chóng.</li>\n</ul>",
  "updated_at": null
}