{
  "id": "lesson_bai-02-quan-lu-pham-vi-du-an",
  "title": "lesson_bai-02-quan-lu-pham-vi-du-an",
  "body": "<h1>🧩 BÀI 02 – QUẢN LÝ PHẠM VI DỰ ÁN</h1><h2>🎯 Mục tiêu học tập</h2><ul>  <li>Hiểu khái niệm và vai trò của phạm vi trong quản lý dự án CNTT.</li>  <li>Biết cách xác định và ghi nhận yêu cầu của khách hàng.</li>  <li>Hiểu và xây dựng được <b>WBS (Work Breakdown Structure)</b>.</li>  <li>Nhận biết quy trình kiểm soát thay đổi phạm vi (Scope Change Control).</li>  <li>Thực hành mô hình hóa phạm vi bằng sơ đồ phân rã công việc.</li></ul><hr><h2>1. Khái niệm về phạm vi dự án (Project Scope)</h2><p><b>Phạm vi dự án</b> là tổng thể các công việc cần thiết để hoàn thành sản phẩm, dịch vụ hoặc kết quả của dự án.</p><p>Mục tiêu của quản lý phạm vi là đảm bảo dự án chỉ bao gồm những công việc cần thiết và tránh <b>scope creep</b> – mở rộng phạm vi không kiểm soát.</p><hr><h2>2. Các thành phần của quản lý phạm vi</h2><ul>  <li>Xác định yêu cầu (Collect Requirements).</li>  <li>Xác định phạm vi (Define Scope).</li>  <li>Tạo WBS (Create Work Breakdown Structure).</li>  <li>Xác minh phạm vi (Validate Scope).</li>  <li>Kiểm soát phạm vi (Control Scope).</li></ul><hr><h2>3. Quy trình quản lý phạm vi dự án CNTT</h2><p>Quản lý phạm vi trong dự án CNTT thường tuân theo quy trình:</p><ol>  <li><b>Phân tích yêu cầu:</b> thu thập thông tin từ khách hàng, người dùng.</li>  <li><b>Xác định mục tiêu dự án:</b> định nghĩa rõ đầu ra (Deliverables).</li>  <li><b>Tạo WBS:</b> chia nhỏ công việc theo cấu trúc phân rã logic.</li>  <li><b>Xác nhận phạm vi:</b> stakeholder đồng ý phạm vi qua bản Scope Statement.</li>  <li><b>Kiểm soát thay đổi:</b> ghi nhận, phê duyệt và cập nhật phạm vi mới.</li></ol><hr><h2>4. Tài liệu phạm vi (Scope Baseline)</h2><ul>  <li><b>Project Scope Statement:</b> mô tả chi tiết sản phẩm và giới hạn công việc.</li>  <li><b>WBS:</b> biểu diễn công việc phân rã đến cấp có thể quản lý được.</li>  <li><b>WBS Dictionary:</b> mô tả nội dung chi tiết của từng phần tử WBS.</li></ul><hr><h2>5. WBS – Cấu trúc phân rã công việc</h2><p><b>WBS</b> là nền tảng để lập kế hoạch, ước lượng chi phí, tiến độ, và quản lý chất lượng.</p><pre><code>Ví dụ WBS cho Dự án Phát triển Website Bán hàng:1. Dự án Website Thương mại điện tử   1.1 Phân tích yêu cầu   1.2 Thiết kế giao diện   1.3 Lập trình Backend   1.4 Tích hợp CSDL   1.5 Kiểm thử &amp; Triển khai</code></pre><p><b>Nguyên tắc:</b></p><ul>  <li>Phân rã công việc đến cấp có thể ước lượng và kiểm soát.</li>  <li>Mỗi phần tử WBS nên có <b>mã số duy nhất</b> (code).</li>  <li>Tổng tất cả phần tử cấp dưới phải đại diện chính xác cho phần tử cấp trên.</li></ul><hr><h2>6. Kiểm soát thay đổi phạm vi</h2><p>Khi yêu cầu khách hàng thay đổi:</p><ol>  <li>Ghi nhận yêu cầu bằng <b>Change Request Form</b>.</li>  <li>Phân tích tác động (chi phí, thời gian, rủi ro).</li>  <li>Trình hội đồng phê duyệt (Change Control Board).</li>  <li>Cập nhật lại WBS và Scope Baseline.</li></ol><pre><code>if (change_approved) {   update(WBS);   update(ProjectPlan);}</code></pre><hr><h2>7. Các công cụ hỗ trợ quản lý phạm vi</h2><ul>  <li>MS Project, Lucidchart, WBS Gantt, ClickUp, Jira Roadmap.</li>  <li>Phần mềm trực quan hóa WBS: SmartDraw, MindManager, Edraw.</li></ul><hr><h2>🧠 Case Study</h2><p><b>Tình huống:</b> Trong dự án phần mềm quản lý sinh viên, khách hàng muốn bổ sung module quản lý ký túc xá sau khi đã ký hợp đồng.</p><p><b>Phân tích:</b></p><ul>  <li>Đây là mở rộng phạm vi (Scope Creep).</li>  <li>Phải lập Change Request và cập nhật lại phạm vi.</li>  <li>Không được thay đổi nếu không có phê duyệt chính thức.</li></ul><hr><h2>✅ Tổng kết</h2><ul>  <li>Phạm vi là nền tảng để lập kế hoạch dự án.</li>  <li>WBS giúp chia nhỏ công việc, quản lý hiệu quả hơn.</li>  <li>Kiểm soát thay đổi phạm vi giúp tránh vượt chi phí và trễ tiến độ.</li></ul>",
  "updated_at": null
}