{
  "title": "BÀI 01 – MỞ ĐẦU VỀ QUẢN LÝ DỰ ÁN CÔNG NGHỆ THÔNG TIN",
  "created_at": "2025-10-14T10:44:13Z",
  "url": "bai-01-mo-dau-ve-quan-lu-du-an-cong-nghe-thong-tin",
  "editing_roles": "teachers",
  "page_id": 157,
  "last_edited_by": {
    "id": 1,
    "anonymous_id": "1",
    "display_name": "admin@gmail.com",
    "avatar_image_url": "http://localhost:3000/images/messages/avatar-50.png",
    "html_url": "http://localhost:3000/courses/4/users/1",
    "pronouns": null
  },
  "published": true,
  "hide_from_students": false,
  "front_page": false,
  "html_url": "http://localhost:3000/courses/4/pages/bai-01-mo-dau-ve-quan-lu-du-an-cong-nghe-thong-tin",
  "todo_date": null,
  "publish_at": null,
  "updated_at": "2025-10-14T10:44:31Z",
  "locked_for_user": false,
  "body": "<h1>🧩 BÀI 01 – MỞ ĐẦU VỀ QUẢN LÝ DỰ ÁN CÔNG NGHỆ THÔNG TIN</h1><h2>🎯 Mục tiêu học tập</h2><ul>  <li>Hiểu được khái niệm dự án và quản lý dự án trong lĩnh vực CNTT.</li>  <li>Nắm được vai trò, phạm vi, và các yếu tố ràng buộc của dự án.</li>  <li>Phân biệt dự án CNTT với các loại dự án khác (xây dựng, sản xuất,...).</li>  <li>Hiểu cấu trúc tổ chức, quy trình và vòng đời của dự án CNTT.</li>  <li>Nhận diện yếu tố thành công, rủi ro và công cụ hỗ trợ trong quản lý dự án.</li></ul><hr><h2>1. Khái niệm cơ bản</h2><p><b>Dự án (Project)</b> là một tập hợp các hoạt động có mục tiêu cụ thể, thời gian và nguồn lực giới hạn, nhằm tạo ra một sản phẩm hoặc kết quả duy nhất.</p><p><b>Quản lý dự án (Project Management)</b> là việc áp dụng kiến thức, kỹ năng, công cụ và kỹ thuật vào các hoạt động dự án nhằm đạt được các mục tiêu đã đề ra.</p><p><b>Dự án CNTT</b> là dự án tập trung vào phát triển, triển khai, bảo trì hệ thống phần mềm, phần cứng hoặc dịch vụ công nghệ thông tin.</p><hr><h2>2. Đặc điểm của dự án CNTT</h2><ul>  <li>Kết quả vô hình (phần mềm, hệ thống, dịch vụ,...).</li>  <li>Yêu cầu thay đổi liên tục theo người dùng.</li>  <li>Phụ thuộc nhiều vào yếu tố con người và tri thức.</li>  <li>Khó ước lượng chi phí và thời gian chính xác.</li></ul><hr><h2>3. Các yếu tố ràng buộc trong quản lý dự án (Project Constraints)</h2><p>Mọi dự án chịu ảnh hưởng của “tam giác ràng buộc”: <b>Phạm vi – Thời gian – Chi phí</b>.</p><p>Các yếu tố khác: Chất lượng, Rủi ro, và Nguồn nhân lực.</p><pre><code>        +----------------+        |   Phạm vi      |        +----------------+          /                    /             +----------------+   +----------------+|   Thời gian    |   |    Chi phí     |+----------------+   +----------------+</code></pre><hr><h2>4. Vai trò của nhà quản lý dự án CNTT</h2><ul>  <li>Lập kế hoạch (Planning).</li>  <li>Điều phối nhân sự và nguồn lực (Organizing).</li>  <li>Theo dõi, giám sát tiến độ (Monitoring).</li>  <li>Giao tiếp và giải quyết xung đột (Communication &amp; Leadership).</li>  <li>Đánh giá, tổng kết dự án (Closing &amp; Reporting).</li></ul><hr><h2>5. Các giai đoạn của dự án CNTT</h2><ol>  <li><b>Khởi động (Initiation):</b> xác định mục tiêu, phạm vi, tài nguyên, stakeholder.</li>  <li><b>Lập kế hoạch (Planning):</b> tạo WBS, lịch trình, ngân sách, kế hoạch rủi ro.</li>  <li><b>Thực hiện (Execution):</b> phân công công việc, giám sát, giao tiếp.</li>  <li><b>Kiểm soát (Monitoring &amp; Control):</b> đo lường tiến độ, kiểm soát thay đổi.</li>  <li><b>Kết thúc (Closing):</b> bàn giao sản phẩm, đánh giá và rút kinh nghiệm.</li></ol><hr><h2>6. Mô hình và phương pháp quản lý dự án CNTT</h2><ul>  <li><b>PMI – PMBOK:</b> Chuẩn quốc tế với 10 lĩnh vực kiến thức (Scope, Time, Cost, Quality,...).</li>  <li><b>Agile:</b> Linh hoạt, phù hợp cho phát triển phần mềm, chia nhỏ thành Sprint.</li>  <li><b>Scrum:</b> Tập trung vào cộng tác nhóm, cải tiến liên tục và phản hồi khách hàng.</li>  <li><b>Hybrid:</b> Kết hợp giữa truyền thống (Waterfall) và Agile.</li></ul><hr><h2>7. Công cụ và phần mềm hỗ trợ quản lý dự án</h2><ul>  <li>Microsoft Project, Trello, Jira, Asana, ClickUp, Monday.</li>  <li>Các công cụ giao tiếp nhóm: Slack, Teams, Zoom.</li>  <li>Phần mềm phân tích và báo cáo: Power BI, Tableau.</li></ul><hr><h2>8. Yếu tố thành công và thất bại của dự án CNTT</h2><ul>  <li><b>Thành công:</b> Mục tiêu rõ ràng, giao tiếp hiệu quả, hỗ trợ từ lãnh đạo, quản lý rủi ro tốt.</li>  <li><b>Thất bại:</b> Phạm vi không rõ, thay đổi yêu cầu liên tục, thiếu năng lực nhóm, không kiểm soát được tiến độ.</li></ul><hr><h2>🧠 Case Study</h2><p><b>Tình huống:</b> Dự án phát triển hệ thống học trực tuyến cho đại học ABC bị chậm tiến độ 3 tháng do thay đổi yêu cầu từ phòng đào tạo.</p><p><b>Phân tích:</b></p><ul>  <li>Nguyên nhân: Quản lý phạm vi yếu, chưa có quy trình kiểm soát thay đổi.</li>  <li>Giải pháp: Áp dụng quy trình Change Request, cập nhật lại kế hoạch WBS.</li>  <li>Bài học: Luôn xác nhận yêu cầu với stakeholder trước khi lập lịch trình.</li></ul><hr><h2>✅ Tổng kết</h2><ul>  <li>Dự án CNTT có đặc trưng phức tạp, yêu cầu quản lý chặt chẽ phạm vi – chi phí – thời gian.</li>  <li>Nhà quản lý dự án phải có kiến thức kỹ thuật và kỹ năng mềm.</li>  <li>Hiểu mô hình Agile, PMI giúp tối ưu hiệu quả quản lý.</li></ul>"
}