{
  "title": "BÀI 8 – QUẢN LÝ BỘ NHỚ ẢO (VIRTUAL MEMORY)",
  "created_at": "2025-10-25T09:02:42Z",
  "url": "bai-8-quan-lu-bo-nho-ao-virtual-memory",
  "editing_roles": "teachers",
  "page_id": 272,
  "last_edited_by": {
    "id": 1,
    "anonymous_id": "1",
    "display_name": "admin@gmail.com",
    "avatar_image_url": "http://localhost:3000/images/messages/avatar-50.png",
    "html_url": "http://localhost:3000/courses/4/users/1",
    "pronouns": null
  },
  "published": true,
  "hide_from_students": false,
  "front_page": false,
  "html_url": "http://localhost:3000/courses/4/pages/bai-8-quan-lu-bo-nho-ao-virtual-memory",
  "todo_date": null,
  "publish_at": null,
  "updated_at": "2025-10-25T09:02:56Z",
  "locked_for_user": false,
  "body": "<h1>🧩 BÀI 8 – QUẢN LÝ BỘ NHỚ ẢO (VIRTUAL MEMORY)</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu khái niệm và vai trò của bộ nhớ ảo trong hệ điều hành hiện đại.</li><li>Nắm rõ cơ chế phân trang theo yêu cầu (Demand Paging) và các lỗi trang (Page Fault).</li><li>Phân tích và so sánh các giải thuật thay thế trang: FIFO, LRU, Optimal.</li><li>Tính toán hiệu suất hệ thống dựa trên tần suất lỗi trang và thời gian truy cập trung bình (EAT).</li></ul><hr><h2>8.1 KHÁI NIỆM BỘ NHỚ ẢO</h2><p>Bộ nhớ ảo (Virtual Memory) là kỹ thuật cho phép chương trình có thể chạy khi kích thước của nó lớn hơn dung lượng bộ nhớ vật lý (RAM). Hệ điều hành sử dụng ổ đĩa làm phần mở rộng của RAM (swap space) và chỉ nạp những trang cần thiết vào bộ nhớ khi cần.</p><p>Lợi ích chính:</p><ul><li>Chạy được chương trình lớn hơn RAM.</li><li>Giảm phân mảnh.</li><li>Tăng tính bảo mật và cô lập tiến trình.</li></ul><hr><h2>8.2 PHÂN TRANG THEO YÊU CẦU (DEMAND PAGING)</h2><p>Trong kỹ thuật này, chỉ những trang được truy cập mới được nạp vào bộ nhớ. Nếu trang chưa có trong RAM → xảy ra lỗi trang (Page Fault).</p><h3>8.2.1 Quy trình xử lý lỗi trang</h3><ol><li>CPU phát hiện truy cập trang chưa có trong RAM.</li><li>OS tìm frame trống trong RAM.</li><li>Nếu không có frame trống → áp dụng thuật toán thay thế trang.</li><li>Nạp trang cần thiết từ đĩa vào RAM, cập nhật bảng trang.</li><li>Tiếp tục thực thi chương trình.</li></ol><hr><h2>8.3 TỶ LỆ LỖI TRANG VÀ THỜI GIAN TRUY CẬP TRUNG BÌNH (EAT)</h2><p><b>Effective Access Time (EAT)</b> = (1 - p) × Tm + p × Td</p><ul><li><b>Tm:</b> Thời gian truy cập bộ nhớ (thường 100ns).</li><li><b>Td:</b> Thời gian phục hồi lỗi trang (vài ms).</li><li><b>p:</b> Tỷ lệ lỗi trang (page fault rate).</li></ul><p>Ví dụ: Nếu Tm = 100ns, Td = 10ms, p = 0.001 → EAT = (1 - 0.001) × 100 + 0.001 × 10,000,000 = 10,099ns ≈ 10.1µs.</p><hr><h2>8.4 CÁC GIẢI THUẬT THAY THẾ TRANG</h2><h3>8.4.1 FIFO (First-In, First-Out)</h3><p>Trang vào trước bị thay thế trước. Đơn giản nhưng có thể gặp <b>Belady’s Anomaly</b> – thêm frame nhưng số lỗi trang tăng.</p><h3>8.4.2 OPTIMAL (Tối ưu)</h3><p>Thay trang sẽ được sử dụng xa nhất trong tương lai. Đây là giải thuật lý tưởng, dùng làm chuẩn so sánh.</p><h3>8.4.3 LRU (Least Recently Used)</h3><p>Thay trang ít được sử dụng gần đây nhất. Giả định rằng các trang được truy cập gần đây sẽ còn được dùng lại.</p><pre><code>Ví dụ: Chuỗi truy cập trang = [7, 0, 1, 2, 0, 3, 0, 4], Frame = 3 → FIFO lỗi 6, LRU lỗi 5, Optimal lỗi 4</code></pre><h3>8.4.4 CLOCK Algorithm</h3><p>Phiên bản cải tiến của LRU, mỗi trang có bit tham chiếu. Khi bit = 0, trang bị thay thế.</p><hr><h2>8.5 NGUYÊN NHÂN LỖI TRANG CAO</h2><ul><li>Kích thước frame quá nhỏ.</li><li>Không gian làm việc (Working Set) của tiến trình lớn hơn RAM.</li><li>Thrashing – hệ thống dành quá nhiều thời gian để hoán đổi trang thay vì thực thi.</li></ul><p>OS theo dõi tập làm việc của mỗi tiến trình để điều chỉnh số frame hợp lý.</p><hr><h2>8.6 SWAPPING VÀ CACHE</h2><p>Swapping là cơ chế di chuyển toàn bộ tiến trình ra đĩa, trong khi paging chỉ di chuyển từng trang. Hệ thống thường kết hợp cả hai để tối ưu hiệu năng.</p><hr><h2>🧠 Tổng kết</h2><ul><li>Bộ nhớ ảo giúp tăng khả năng chạy đa tiến trình, giảm phân mảnh và cô lập lỗi.</li><li>Demand Paging chỉ tải trang cần thiết giúp tiết kiệm RAM.</li><li>LRU và Optimal là hai giải thuật thay thế hiệu quả, FIFO đơn giản nhưng có thể gây lỗi Belady.</li><li>Quản lý bộ nhớ ảo ảnh hưởng trực tiếp đến hiệu năng tổng thể hệ thống.</li></ul>"
}