{
  "title": "BÀI 13 – TỐI ƯU HÓA HIỆU NĂNG TRUY VẤN TRONG CSDL",
  "created_at": "2025-10-25T05:44:52Z",
  "url": "bai-13-toi-uu-hoa-hieu-nang-truy-van-trong-csdl",
  "editing_roles": "teachers",
  "page_id": 253,
  "last_edited_by": {
    "id": 1,
    "anonymous_id": "1",
    "display_name": "admin@gmail.com",
    "avatar_image_url": "http://localhost:3000/images/messages/avatar-50.png",
    "html_url": "http://localhost:3000/courses/4/users/1",
    "pronouns": null
  },
  "published": true,
  "hide_from_students": false,
  "front_page": false,
  "html_url": "http://localhost:3000/courses/4/pages/bai-13-toi-uu-hoa-hieu-nang-truy-van-trong-csdl",
  "todo_date": null,
  "publish_at": null,
  "updated_at": "2025-10-25T05:45:07Z",
  "locked_for_user": false,
  "body": "<h1>🧩 BÀI 13 – TỐI ƯU HÓA HIỆU NĂNG TRUY VẤN TRONG CƠ SỞ DỮ LIỆU</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu rõ các yếu tố ảnh hưởng đến hiệu năng truy vấn trong DBMS.</li><li>Nắm vững vai trò của chỉ mục (index), thống kê (statistics), và kế hoạch thực thi (execution plan).</li><li>Biết cách phân tích và tối ưu hóa truy vấn SQL bằng EXPLAIN/EXPLAIN ANALYZE.</li><li>Thực hành cải thiện hiệu năng bằng kỹ thuật indexing, partitioning, caching, và query rewriting.</li></ul><hr><h2>1. TỔNG QUAN VỀ HIỆU NĂNG TRUY VẤN</h2><p>Hiệu năng truy vấn phụ thuộc vào ba yếu tố chính: <b>cấu trúc dữ liệu</b>, <b>cách viết truy vấn</b> và <b>chiến lược tối ưu của DBMS</b>. Một truy vấn không tối ưu có thể tiêu tốn hàng giây hoặc hàng phút thay vì mili giây.</p><p>Ví dụ: truy vấn chưa có chỉ mục</p><pre><code>SELECT * FROM HoaDon WHERE NgayLap = '2025-10-10';</code></pre><p>Khi bảng HoaDon có hàng triệu bản ghi, việc tìm kiếm tuần tự (sequential scan) sẽ rất chậm nếu không có chỉ mục.</p><hr><h2>2. CHỈ MỤC (INDEX)</h2><h3>2.1 Khái niệm</h3><p>Chỉ mục là cấu trúc dữ liệu giúp tăng tốc độ truy xuất, tương tự mục lục trong sách. DBMS thường sử dụng cây B+Tree, Hash Index hoặc GiST Index.</p><h3>2.2 Cú pháp tạo chỉ mục</h3><pre><code>CREATE INDEX idx_HoaDon_NgayLap ON HoaDon(NgayLap);</code></pre><ul><li><b>Clustered index:</b> lưu trữ dữ liệu vật lý theo thứ tự của chỉ mục (chỉ có một trong mỗi bảng).</li><li><b>Non-clustered index:</b> chỉ chứa con trỏ đến dữ liệu gốc, có thể có nhiều.</li></ul><h3>2.3 Khi nào KHÔNG nên dùng index</h3><ul><li>Bảng nhỏ, ít bản ghi.</li><li>Các cột thường xuyên cập nhật (INSERT/UPDATE/DELETE nhiều).</li><li>Truy vấn trả về phần lớn dữ liệu.</li></ul><hr><h2>3. KẾ HOẠCH THỰC THI (EXECUTION PLAN)</h2><p>DBMS phân tích câu lệnh SQL và chọn chiến lược thực thi tốt nhất.</p><pre><code>EXPLAIN SELECT MaSV, Diem FROM KetQua WHERE Diem &gt;= 8;</code></pre><p>Các bước chính:</p><ul><li>Phân tích cú pháp (Parsing)</li><li>Tối ưu hóa logic (Logical Optimization)</li><li>Tối ưu hóa vật lý (Physical Optimization)</li><li>Thực thi (Execution)</li></ul><p>Kết quả của EXPLAIN giúp nhận biết truy vấn nào đang scan toàn bảng (Seq Scan) hoặc sử dụng Index Scan.</p><hr><h2>4. TỐI ƯU HÓA TRUY VẤN SQL</h2><h3>4.1 Viết truy vấn hiệu quả</h3><ul><li>Chỉ chọn các cột cần thiết thay vì *.</li><li>Dùng EXISTS thay cho IN trong nhiều trường hợp.</li><li>Tránh hàm trên cột trong WHERE (ví dụ: <code>WHERE YEAR(NgayLap)=2025</code> → <code>WHERE NgayLap BETWEEN ...</code>).</li></ul><h3>4.2 Sử dụng JOIN hợp lý</h3><ul><li>Đảm bảo các cột JOIN có chỉ mục.</li><li>Dùng INNER JOIN thay cho OUTER JOIN khi có thể.</li></ul><h3>4.3 Tối ưu hóa GROUP BY và ORDER BY</h3><p>Sử dụng index hỗ trợ sắp xếp hoặc tổng hợp sẽ giảm chi phí tính toán.</p><hr><h2>5. PHÂN MẢNH (PARTITIONING)</h2><p>Phân chia bảng lớn thành nhiều phần nhỏ (partition) dựa trên điều kiện logic như ngày, vùng, hoặc loại dữ liệu.</p><pre><code>CREATE TABLE HoaDon2025 PARTITION OF HoaDon FOR VALUES FROM ('2025-01-01') TO ('2025-12-31');</code></pre><p>Lợi ích: truy vấn chỉ quét dữ liệu trong partition phù hợp, tiết kiệm thời gian và bộ nhớ.</p><hr><h2>6. BỘ NHỚ ĐỆM (CACHE) VÀ THỐNG KÊ</h2><ul><li><b>Query Cache:</b> Lưu kết quả truy vấn thường dùng.</li><li><b>Statistics:</b> Thông tin thống kê giúp optimizer chọn kế hoạch tối ưu.</li></ul><p>Cập nhật thống kê định kỳ:</p><pre><code>ANALYZE HoaDon;</code></pre><hr><h2>7. THỰC HÀNH PHÂN TÍCH HIỆU NĂNG</h2><p>Dùng EXPLAIN ANALYZE trong PostgreSQL để đo thời gian thực tế:</p><pre><code>EXPLAIN ANALYZE SELECT * FROM HoaDon WHERE NgayLap = '2025-10-10';</code></pre><p>→ Output: <code>Index Scan using idx_HoaDon_NgayLap cost=0.43..8.75 rows=1 width=100</code></p><p>Giúp phát hiện bottleneck (nút thắt cổ chai) trong truy vấn.</p><hr><h2>✅ TỔNG KẾT</h2><ul><li>Index là công cụ mạnh mẽ giúp tăng tốc độ truy vấn, nhưng cần sử dụng hợp lý.</li><li>EXPLAIN và EXPLAIN ANALYZE giúp đánh giá hiệu quả thực thi truy vấn.</li><li>Phân mảnh dữ liệu, caching và tối ưu câu SQL là kỹ năng thiết yếu để tối ưu hệ thống thực tế.</li></ul>"
}