{
  "title": "BÀI 04 – CHUẨN HÓA DỮ LIỆU VÀ CÁC DẠNG CHUẨN",
  "created_at": "2025-10-25T04:30:38Z",
  "url": "bai-04-chuan-hoa-du-lieu-va-cac-dang-chuan",
  "editing_roles": "teachers",
  "page_id": 244,
  "last_edited_by": {
    "id": 1,
    "anonymous_id": "1",
    "display_name": "admin@gmail.com",
    "avatar_image_url": "http://localhost:3000/images/messages/avatar-50.png",
    "html_url": "http://localhost:3000/courses/4/users/1",
    "pronouns": null
  },
  "published": true,
  "hide_from_students": false,
  "front_page": false,
  "html_url": "http://localhost:3000/courses/4/pages/bai-04-chuan-hoa-du-lieu-va-cac-dang-chuan",
  "todo_date": null,
  "publish_at": null,
  "updated_at": "2025-10-25T04:30:53Z",
  "locked_for_user": false,
  "body": "<h1>🧩 BÀI 04 – CHUẨN HÓA DỮ LIỆU VÀ CÁC DẠNG CHUẨN</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu khái niệm chuẩn hóa dữ liệu và mục tiêu của quá trình này trong thiết kế cơ sở dữ liệu.</li><li>Nắm vững các dạng chuẩn (1NF → 5NF, BCNF) và cách áp dụng để loại bỏ dư thừa dữ liệu, tránh bất thường khi cập nhật.</li><li>Phân tích và chuyển đổi một mô hình quan hệ chưa chuẩn hóa thành dạng chuẩn tối ưu.</li><li>Nhận diện được khi nào cần chuẩn hóa và khi nào nên giải chuẩn (denormalization) để tối ưu hiệu năng.</li></ul><hr><h2>1. KHÁI NIỆM CHUẨN HÓA DỮ LIỆU</h2><p>Chuẩn hóa dữ liệu (Normalization) là quá trình tổ chức dữ liệu trong cơ sở dữ liệu sao cho giảm thiểu dư thừa và đảm bảo tính toàn vẹn. Mục tiêu là loại bỏ các bất thường (anomalies) khi chèn, cập nhật hoặc xóa dữ liệu.</p><h3>1.1 Lý do cần chuẩn hóa</h3><ul><li>Giảm trùng lặp dữ liệu.</li><li>Tăng tính nhất quán và toàn vẹn.</li><li>Giúp cập nhật, thêm, xóa dữ liệu dễ dàng mà không ảnh hưởng đến các bảng khác.</li><li>Hỗ trợ mở rộng hệ thống dễ dàng hơn.</li></ul><h3>1.2 Ba loại bất thường thường gặp</h3><ul><li><b>Insertion anomaly:</b> Không thể thêm dữ liệu do thiếu thông tin phụ thuộc.</li><li><b>Update anomaly:</b> Dữ liệu phải cập nhật ở nhiều nơi.</li><li><b>Deletion anomaly:</b> Mất thông tin khi xóa dữ liệu khác.</li></ul><hr><h2>2. QUÁ TRÌNH CHUẨN HÓA</h2><p>Chuẩn hóa được thực hiện qua nhiều mức, gọi là các dạng chuẩn (Normal Forms).</p><ul><li><b>1NF:</b> Mọi thuộc tính là nguyên tố (atomic), không chứa giá trị lặp hoặc nhóm lặp.</li><li><b>2NF:</b> Thuộc tính không khóa phải phụ thuộc đầy đủ vào khóa chính, không phụ thuộc bộ phận.</li><li><b>3NF:</b> Không có phụ thuộc bắc cầu giữa các thuộc tính không khóa.</li><li><b>BCNF:</b> Mọi phụ thuộc hàm A → B đều có A là siêu khóa.</li><li><b>4NF:</b> Loại bỏ phụ thuộc đa trị, đảm bảo mỗi thuộc tính chỉ phụ thuộc vào khóa.</li><li><b>5NF:</b> Loại bỏ phụ thuộc nối (join dependency), đạt tối ưu cao nhất.</li></ul><hr><h2>3. VÍ DỤ MINH HỌA</h2><p><b>Ví dụ:</b> Cho bảng SINHVIEN(MaSV, TenSV, MaMH, TenMH, DiemMH). Bảng này có lỗi dư thừa vì mỗi sinh viên có thể học nhiều môn, tên sinh viên và tên môn lặp lại.</p><ul><li><b>Bước 1:</b> 1NF – Dữ liệu phải nguyên tố (đảm bảo mỗi ô chỉ chứa một giá trị duy nhất).</li><li><b>Bước 2:</b> 2NF – Tách bảng thành SINHVIEN(MaSV, TenSV) và DANGKY(MaSV, MaMH, DiemMH) để loại bỏ phụ thuộc bộ phận.</li><li><b>Bước 3:</b> 3NF – Đảm bảo không có phụ thuộc bắc cầu như MaSV → MaLop và MaLop → GV.</li></ul><p><b>Kết quả:</b> Hệ thống đạt 3NF giúp giảm dư thừa và tránh lỗi cập nhật.</p><hr><h2>4. GIẢI CHUẨN (DENORMALIZATION)</h2><p>Giải chuẩn là quá trình kết hợp một số bảng đã chuẩn hóa nhằm cải thiện hiệu năng truy vấn, đặc biệt trong hệ thống lớn. Tuy nhiên, điều này có thể gây dư thừa dữ liệu và tăng chi phí cập nhật.</p><ul><li>Áp dụng khi cần tốc độ truy vấn nhanh (data warehouse, OLAP).</li><li>Cần có cơ chế đồng bộ và kiểm soát lỗi dư thừa dữ liệu.</li></ul><hr><h2>5. KIỂM TRA VÀ ỨNG DỤNG</h2><ul><li>Kiểm tra các dạng chuẩn bằng cách xác định khóa và phụ thuộc hàm.</li><li>Sử dụng công cụ như SQL Power Architect hoặc ERD Tool để mô phỏng chuẩn hóa.</li><li>Thực hành chuẩn hóa dữ liệu trong các hệ thống như quản lý sinh viên, bán hàng, ngân hàng.</li></ul><hr><h2>✅ TỔNG KẾT</h2><ul><li>Chuẩn hóa giúp hệ thống dữ liệu nhất quán, giảm lỗi và dễ bảo trì.</li><li>Tuy nhiên, cần cân bằng giữa chuẩn hóa và hiệu năng hệ thống thực tế.</li><li>Các dạng chuẩn cao hơn (BCNF, 4NF, 5NF) chỉ nên áp dụng khi thật cần thiết.</li></ul>"
}