{
  "title": "BÀI 12 – AN TOÀN VÀ BẢO MẬT TRONG CƠ SỞ DỮ LIỆU",
  "created_at": "2025-10-25T05:36:45Z",
  "url": "bai-12-an-toan-va-bao-mat-trong-co-so-du-lieu",
  "editing_roles": "teachers",
  "page_id": 252,
  "last_edited_by": {
    "id": 1,
    "anonymous_id": "1",
    "display_name": "admin@gmail.com",
    "avatar_image_url": "http://localhost:3000/images/messages/avatar-50.png",
    "html_url": "http://localhost:3000/courses/4/users/1",
    "pronouns": null
  },
  "published": true,
  "hide_from_students": false,
  "front_page": false,
  "html_url": "http://localhost:3000/courses/4/pages/bai-12-an-toan-va-bao-mat-trong-co-so-du-lieu",
  "todo_date": null,
  "publish_at": null,
  "updated_at": "2025-10-25T05:37:00Z",
  "locked_for_user": false,
  "body": "<h1>🧩 BÀI 12 – AN TOÀN VÀ BẢO MẬT TRONG CƠ SỞ DỮ LIỆU</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu rõ các nguyên tắc bảo mật cơ sở dữ liệu: xác thực, phân quyền, mã hóa và ghi vết truy cập.</li><li>Phân biệt giữa an toàn hệ thống (safety) và bảo mật dữ liệu (security).</li><li>Nắm vững cơ chế phân quyền người dùng trong DBMS (GRANT, REVOKE, ROLE).</li><li>Áp dụng các phương pháp bảo mật dữ liệu nhạy cảm như mã hóa, ẩn danh, và kiểm soát truy cập động (row-level security).</li></ul><hr><h2>1. KHÁI NIỆM AN TOÀN VÀ BẢO MẬT</h2><p><b>An toàn dữ liệu (Data Safety):</b> đảm bảo dữ liệu không bị mất mát hoặc hỏng hóc do sự cố kỹ thuật.</p><p><b>Bảo mật dữ liệu (Data Security):</b> đảm bảo dữ liệu không bị truy cập, sửa đổi, hoặc đánh cắp trái phép.</p><p>Hai yếu tố này là nền tảng quan trọng để đảm bảo tính <b>toàn vẹn, sẵn sàng và bảo mật</b> của hệ thống (CIA – Confidentiality, Integrity, Availability).</p><hr><h2>2. PHÂN QUYỀN TRONG HỆ QUẢN TRỊ CSDL</h2><h3>2.1 Xác thực người dùng</h3><p>Người dùng phải đăng nhập với tên và mật khẩu hợp lệ trước khi truy cập dữ liệu.</p><h3>2.2 Phân quyền cơ bản</h3><p>Hệ quản trị CSDL cho phép cấp quyền cụ thể cho người dùng hoặc nhóm:</p><pre><code>GRANT SELECT, INSERT ON SinhVien TO userA;<br>REVOKE INSERT ON SinhVien FROM userA;</code></pre><ul><li><b>GRANT:</b> cấp quyền cho người dùng.</li><li><b>REVOKE:</b> thu hồi quyền.</li><li><b>ROLE:</b> nhóm các quyền để quản lý tập trung.</li></ul><pre><code>CREATE ROLE GiangVien;<br>GRANT SELECT, UPDATE ON Diem TO GiangVien;<br>GRANT GiangVien TO userGV01;</code></pre><hr><h2>3. CÁC MỨC ĐỘ BẢO MẬT</h2><ul><li><b>Ở mức hệ điều hành:</b> Bảo vệ file dữ liệu vật lý bằng quyền truy cập OS.</li><li><b>Ở mức DBMS:</b> Cấp quyền chi tiết trên bảng, cột, view.</li><li><b>Ở mức ứng dụng:</b> Kiểm tra người dùng, token, session.</li><li><b>Ở mức mạng:</b> Mã hóa đường truyền, SSL/TLS.</li></ul><hr><h2>4. CÁC KỸ THUẬT BẢO MẬT DỮ LIỆU</h2><ul><li><b>Mã hóa (Encryption):</b> chuyển dữ liệu gốc sang dạng mã hóa để bảo vệ thông tin.</li><li><b>Ẩn danh dữ liệu (Data Masking):</b> che giấu dữ liệu nhạy cảm khi chia sẻ.</li><li><b>Row-Level Security:</b> Giới hạn truy cập theo hàng dữ liệu tùy người dùng.</li></ul><pre><code>CREATE SECURITY POLICY PolicyDiem<br>ADD FILTER PREDICATE fn_FilterSV(MaSV) ON Diem<br>WITH (STATE = ON);</code></pre><h3>4.1 Ví dụ mã hóa dữ liệu trong SQL Server</h3><pre><code>CREATE MASTER KEY ENCRYPTION BY PASSWORD = 'Pass@123';<br>CREATE CERTIFICATE CertData WITH SUBJECT = 'Certificate for Encryption';<br>CREATE SYMMETRIC KEY SymKeyData WITH ALGORITHM = AES_256 ENCRYPTION BY CERTIFICATE CertData;<br>OPEN SYMMETRIC KEY SymKeyData DECRYPTION BY CERTIFICATE CertData;<br>UPDATE SinhVien SET SoCMND = ENCRYPTBYKEY(KEY_GUID('SymKeyData'), '123456789');</code></pre><hr><h2>5. KIỂM SOÁT TRUY CẬP VÀ GHI VẾT</h2><ul><li><b>Audit log:</b> theo dõi thao tác người dùng (ai, khi nào, hành động gì).</li><li><b>Database trigger:</b> tự động ghi lại khi dữ liệu bị thay đổi.</li></ul><pre><code>CREATE TRIGGER trg_LogUpdateDiem<br>ON Diem AFTER UPDATE<br>AS INSERT INTO LogDiem(MaSV, ThoiGian, NguoiThayDoi)<br>SELECT i.MaSV, GETDATE(), SYSTEM_USER FROM inserted i;</code></pre><p>Việc ghi log giúp phát hiện xâm nhập hoặc thao tác bất thường.</p><hr><h2>6. BIỆN PHÁP BẢO MẬT NÂNG CAO</h2><ul><li>Áp dụng xác thực đa yếu tố (MFA) cho tài khoản quản trị.</li><li>Giới hạn IP truy cập và dùng VPN bảo mật.</li><li>Thiết lập sao lưu mã hóa định kỳ.</li><li>Thường xuyên cập nhật DBMS để vá lỗ hổng bảo mật.</li></ul><hr><h2>✅ TỔNG KẾT</h2><ul><li>Bảo mật dữ liệu là nhiệm vụ liên tục, đòi hỏi kiểm soát ở nhiều lớp.</li><li>Áp dụng phân quyền, mã hóa, ghi vết, và chính sách truy cập giúp giảm thiểu rủi ro rò rỉ dữ liệu.</li><li>Đảm bảo nguyên tắc CIA là mục tiêu cốt lõi của bảo mật cơ sở dữ liệu.</li></ul>"
}