{
  "id": "lesson_bai-12-dia-chi-ipv6",
  "title": "lesson_bai-12-dia-chi-ipv6",
  "body": "<h1>🌐 BÀI 12 – ĐỊA CHỈ IPv6</h1><h2>12.1 VẤN ĐỀ IPv4</h2><p>IPv4 chỉ có 32 bit → 4,3 tỷ địa chỉ, trong khi số lượng thiết bị Internet (IoT, smartphone, server, camera, v.v.) ngày càng tăng mạnh. Không gian IPv4 dần cạn kiệt. Giải pháp tạm thời như NAT giúp kéo dài tuổi thọ IPv4 nhưng làm phức tạp cấu hình và giảm hiệu năng.</p><p>Do đó, IETF đã phát triển <b>IPv6</b> để thay thế IPv4, với không gian địa chỉ khổng lồ, bảo mật và tự động cấu hình tốt hơn.</p><hr><h2>12.2 ĐỊA CHỈ IPv6</h2><p>IPv6 dài <b>128 bit</b>, cho phép 2<sup>128</sup> địa chỉ (~3.4×10<sup>38</sup>). Địa chỉ được chia thành 8 nhóm, mỗi nhóm 16 bit (4 ký tự hex), cách nhau bởi dấu hai chấm (:).</p><pre>Ví dụ: 2001:0DB8:0000:0000:0000:8A2E:0370:7334</pre><p>Có thể rút gọn:</p><pre>2001:DB8::8A2E:370:7334</pre><ul><li><b>Không phân biệt chữ hoa – chữ thường.</b></li><li><b>Chỉ có thể viết rút gọn một lần bằng ::</b></li></ul><p>IPv6 không dùng <code>dot-decimal</code> mà dùng <b>hexadecimal</b>.</p><hr><h2>12.3 CÁC LOẠI ĐỊA CHỈ IPv6</h2><ul><li><b>Unicast:</b> Một địa chỉ duy nhất cho một thiết bị.</li><ul><li><b>Global Unicast Address (GUA):</b> Dạng công khai, tương tự public IPv4. Bắt đầu bằng 2000::/3.</li><li><b>Link-Local Address (LLA):</b> Dạng cục bộ, chỉ dùng trong mạng nội bộ, bắt đầu bằng FE80::/10.</li><li><b>Unique Local Address (ULA):</b> Dạng nội bộ tương tự IPv4 private, bắt đầu bằng FC00::/7.</li></ul><li><b>Multicast:</b> Dành cho nhóm thiết bị (bắt đầu bằng FF00::/8).</li><li><b>Anycast:</b> Nhiều thiết bị chia sẻ cùng một địa chỉ, gói tin sẽ đến thiết bị gần nhất.</li></ul><hr><h2>12.4 CẤU HÌNH MANUAL ĐỊA CHỈ IPv6 GUA</h2><p>Trên router Cisco:</p><pre>R1(config)# interface gigabitEthernet 0/0<br>R1(config-if)# ipv6 address 2001:DB8:1::1/64<br>R1(config-if)# no shutdown</pre><p>Trên Windows:</p><pre>netsh interface ipv6 set address \"Ethernet\" 2001:db8:1::10</pre><hr><h2>12.5 CẤU HÌNH DYNAMIC ĐỊA CHỈ IPv6 GUA</h2><p>IPv6 hỗ trợ <b>tự động cấu hình</b> bằng SLAAC (Stateless Address Auto Configuration):</p><ol><li>Host gửi <b>Router Solicitation (RS)</b>.</li><li>Router trả về <b>Router Advertisement (RA)</b> chứa prefix mạng.</li><li>Host tự tạo địa chỉ IPv6 = prefix + Interface ID.</li></ol><p><b>Ví dụ:</b> Router quảng bá 2001:DB8:1::/64 → host tự cấu hình 2001:DB8:1::A1B2:CCFF:FE12:9CDE.</p><hr><h2>12.6 CẤU HÌNH DYNAMIC ĐỊA CHỈ IPv6 LLA</h2><p><b>Link-Local Address</b> (FE80::/10) được tự động gán cho mọi interface IPv6, dùng cho kết nối nội bộ trong cùng mạng LAN.</p><pre>FE80::A00:27FF:FE4E:66A1</pre><p>→ Không cần cấu hình thủ công, luôn tồn tại miễn là interface bật IPv6.</p><p>LLA được dùng làm địa chỉ nguồn trong quá trình gửi Router Solicitation và Neighbor Discovery.</p><hr><h2>12.7 IPv6 MULTICAST</h2><p>Địa chỉ bắt đầu bằng <code>FF00::/8</code>.</p><p>Các nhóm multicast thông dụng:</p><ul><li><b>FF02::1:</b> Tất cả host trong mạng cục bộ.</li><li><b>FF02::2:</b> Tất cả router.</li><li><b>FF02::1:FFxx:xxxx:</b> Nhóm multicast theo MAC (Neighbor Solicitation).</li></ul><p>IPv6 không có broadcast, thay thế bằng multicast để giảm lưu lượng không cần thiết.</p><hr><h2>12.8 CHIA MẠNG CON VỚI IPv6</h2><p>IPv6 dùng khái niệm <b>Prefix Length</b> thay cho Subnet Mask. Mỗi mạng con thường có /64 (64 bit đầu cho Network, 64 bit sau cho Host).</p><pre>2001:DB8:ACAD::/48 → có thể chia thành 65.536 mạng /64</pre><p>→ Không cần tính toán phức tạp như IPv4.</p><h3>✅ Tổng kết</h3><ul><li>IPv6 giải quyết triệt để vấn đề cạn kiệt địa chỉ của IPv4.</li><li>IPv6 có cấu trúc đơn giản, hỗ trợ tự cấu hình (SLAAC) và bảo mật IPSec.</li><li>Không có broadcast, chỉ dùng multicast để truyền hiệu quả hơn.</li></ul>",
  "updated_at": null
}