{
  "title": "BÀI 03 – GIỚI THIỆU VỀ NGÔN NGỮ LẬP TRÌNH C",
  "created_at": "2025-10-19T07:40:18Z",
  "url": "bai-03-gioi-thieu-ve-ngon-ngu-lap-trinh-c",
  "editing_roles": "teachers",
  "page_id": 195,
  "last_edited_by": {
    "id": 1,
    "anonymous_id": "1",
    "display_name": "admin@gmail.com",
    "avatar_image_url": "http://localhost:3000/images/messages/avatar-50.png",
    "html_url": "http://localhost:3000/courses/4/users/1",
    "pronouns": null
  },
  "published": true,
  "hide_from_students": false,
  "front_page": false,
  "html_url": "http://localhost:3000/courses/4/pages/bai-03-gioi-thieu-ve-ngon-ngu-lap-trinh-c",
  "todo_date": null,
  "publish_at": null,
  "updated_at": "2025-10-19T07:40:32Z",
  "locked_for_user": false,
  "body": "<h1>🧩 BÀI 03 – GIỚI THIỆU VỀ NGÔN NGỮ LẬP TRÌNH C</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu lịch sử hình thành và đặc điểm của ngôn ngữ lập trình C.</li><li>Nắm vững cấu trúc cơ bản của một chương trình C.</li><li>Phân biệt trình biên dịch, trình liên kết và môi trường phát triển Dev-C++.</li><li>Thực hành viết và biên dịch chương trình đầu tiên.</li></ul><hr><h2>1. KHÁI NIỆM VỀ NGÔN NGỮ LẬP TRÌNH</h2><h3>1.1. Khái niệm chung</h3><p>Ngôn ngữ lập trình là hệ thống ký hiệu, cú pháp và quy tắc logic cho phép lập trình viên mô tả giải thuật để máy tính thực thi. Mỗi ngôn ngữ cung cấp cú pháp riêng để biểu diễn dữ liệu, thao tác và điều khiển luồng chương trình.</p><h3>1.2. Lịch sử và vai trò của C</h3><p>Ngôn ngữ C được phát triển bởi <b>Dennis Ritchie</b> tại Bell Labs vào đầu thập niên 1970, kế thừa từ ngôn ngữ B và BCPL. C được dùng để viết hệ điều hành <b>UNIX</b> và trở thành nền tảng cho nhiều ngôn ngữ khác như C++, Java, C#, Objective-C.</p><ul><li><b>Mạnh mẽ:</b> truy cập cấp thấp (pointer, memory).</li><li><b>Hiệu quả cao:</b> biên dịch trực tiếp thành mã máy.</li><li><b>Di động:</b> có thể chạy trên nhiều hệ điều hành khác nhau.</li><li><b>Phổ biến:</b> là nền tảng của lập trình hệ thống, nhúng và khoa học máy tính.</li></ul><h3>1.3. So sánh C với các ngôn ngữ khác</h3><ul><li><b>So với Python:</b> C nhanh hơn, kiểm soát bộ nhớ thủ công.</li><li><b>So với Java:</b> C đơn giản hơn, nhưng không có OOP tích hợp.</li><li><b>So với Assembly:</b> C dễ đọc, dễ học hơn, ít phụ thuộc phần cứng.</li></ul><hr><h2>2. CẤU TRÚC MỘT CHƯƠNG TRÌNH C</h2><h3>2.1. Cấu trúc tổng quát</h3><pre><code>#include \n\nint main() {\n    // khai báo biến\n    printf(\"Hello, world!\\n\");\n    return 0;\n}</code></pre><p>Giải thích:</p><ul><li><b>#include &lt;stdio.h&gt;</b>: khai báo thư viện chuẩn dùng cho nhập/xuất.</li><li><b>main()</b>: hàm chính, điểm bắt đầu thực thi chương trình.</li><li><b>printf()</b>: hàm in ra màn hình.</li><li><b>return 0;</b>: báo hiệu chương trình kết thúc thành công.</li></ul><h3>2.2. Các thành phần cú pháp cơ bản</h3><ul><li><b>Từ khóa (keywords):</b> int, float, if, while, return,...</li><li><b>Biến (variables):</b> lưu trữ dữ liệu.</li><li><b>Hằng (constants):</b> giá trị cố định.</li><li><b>Toán tử (operators):</b> +, −, *, /, %, ==, &amp;&amp;, ||,...</li><li><b>Cấu trúc khối:</b> dùng dấu ngoặc { }</li><li><b>Dòng lệnh kết thúc bằng dấu chấm phẩy ‘;’</b>.</li></ul><h3>2.3. Quá trình biên dịch và thực thi</h3><p>Một chương trình C trải qua bốn giai đoạn:</p><ol><li><b>Tiền xử lý (Preprocessing):</b> xử lý chỉ thị #include, #define.</li><li><b>Biên dịch (Compilation):</b> dịch mã nguồn thành mã máy trung gian (.obj).</li><li><b>Liên kết (Linking):</b> ghép các mô-đun và thư viện thành file thực thi (.exe).</li><li><b>Thực thi (Execution):</b> CPU nạp chương trình vào bộ nhớ và chạy.</li></ol><hr><h2>3. MÔI TRƯỜNG LẬP TRÌNH DEV-C++</h2><h3>3.1. Giới thiệu</h3><p><b>Dev-C++</b> là môi trường lập trình tích hợp (IDE) miễn phí cho ngôn ngữ C/C++ sử dụng trình biên dịch <b>MinGW (GCC)</b>. Nó hỗ trợ quản lý dự án, biên dịch, gỡ lỗi (debug) và chạy chương trình trực tiếp.</p><h3>3.2. Các thành phần chính</h3><ul><li>Thanh công cụ (Toolbar): chứa nút chạy, lưu, mở, build.</li><li>Trình soạn thảo (Editor): nơi viết mã nguồn.</li><li>Cửa sổ log (Compiler Output): hiển thị lỗi khi biên dịch.</li><li>Cửa sổ console: nơi hiển thị kết quả chạy chương trình.</li></ul><h3>3.3. Quy trình tạo chương trình đầu tiên</h3><ol><li>Mở Dev-C++ → File → New → Source File.</li><li>Nhập mã ví dụ <code>printf(\"Hello World!\\n\");</code>.</li><li>Lưu với phần mở rộng <b>.c</b>.</li><li>Nhấn F11 để <b>biên dịch và chạy</b>.</li></ol><h3>3.4. Xử lý lỗi khi biên dịch</h3><ul><li><b>error:</b> sai cú pháp (thiếu dấu ; hoặc ngoặc).</li><li><b>warning:</b> cảnh báo kiểu dữ liệu, chưa khởi tạo biến.</li><li><b>undefined reference:</b> thiếu thư viện liên kết.</li></ul><hr><h2>✅ TỔNG KẾT</h2><ul><li>Ngôn ngữ C là nền tảng của hầu hết hệ thống phần mềm.</li><li>Chương trình C gồm các thành phần: thư viện, hàm main, câu lệnh, và cú pháp chặt chẽ.</li><li>Hiểu rõ chu trình biên dịch giúp lập trình viên tối ưu chương trình và xử lý lỗi nhanh hơn.</li></ul>"
}