{
  "id": "lesson_bai-01-tong-quan-ve-phan-mem-ma-nguon-mo",
  "title": "lesson_bai-01-tong-quan-ve-phan-mem-ma-nguon-mo",
  "body": "<h1>🧩 BÀI 01 – TỔNG QUAN VỀ PHẦN MỀM MÃ NGUỒN MỞ</h1><h2>🎯 Mục tiêu học tập</h2><ul> <li>Hiểu rõ khái niệm phần mềm mã nguồn mở (Open Source Software – OSS) và khác biệt với phần mềm thương mại.</li> <li>Nắm được lịch sử hình thành, triết lý tự do phần mềm (Free Software) và sự ra đời của phong trào mã nguồn mở.</li> <li>Phân biệt các loại giấy phép (GPL, LGPL, MIT, BSD, Apache) và tác động pháp lý khi sử dụng hoặc phân phối.</li> <li>Phân tích mô hình phát triển cộng đồng và quy trình kiểm soát chất lượng phần mềm mở.</li> <li>Nhận biết các dự án mã nguồn mở nổi bật và vai trò của chúng trong doanh nghiệp, giáo dục và chính phủ.</li></ul><hr><h2>1. Khái niệm cơ bản</h2><p><b>Phần mềm mã nguồn mở (Open Source Software - OSS)</b> là phần mềm mà mã nguồn (source code) được công khai cho phép bất kỳ ai xem, chỉnh sửa, hoặc phân phối lại theo điều kiện của giấy phép.</p><p><b>Khác biệt:</b></p><table border=\"1\" cellpadding=\"6\"><thead><tr><th>Tiêu chí</th><th>Mã nguồn mở</th><th>Phần mềm thương mại</th></tr></thead><tbody><tr><td>Truy cập mã nguồn</td><td>Công khai, chỉnh sửa được</td><td>Đóng kín, không chia sẻ</td></tr><tr><td>Chi phí</td><td>Miễn phí hoặc chi phí thấp</td><td>Trả phí bản quyền</td></tr><tr><td>Cộng đồng hỗ trợ</td><td>Đông đảo, phi lợi nhuận</td><td>Nhà cung cấp duy nhất</td></tr><tr><td>Bảo mật</td><td>Minh bạch, dễ kiểm tra lỗi</td><td>Phụ thuộc nhà phát hành</td></tr></tbody></table><hr><h2>2. Lịch sử và triết lý phát triển</h2><ul> <li><b>1983:</b> Richard Stallman khởi xướng dự án GNU và khái niệm “Free Software”.</li> <li><b>1985:</b> Thành lập Free Software Foundation (FSF).</li> <li><b>1991:</b> Linus Torvalds phát hành Linux kernel, trở thành nền tảng biểu tượng cho mã nguồn mở.</li> <li><b>1998:</b> Thuật ngữ “Open Source” ra đời, do nhóm OSI (Open Source Initiative) định nghĩa chính thức.</li></ul><p><b>Triết lý:</b> “Tự do không có nghĩa là miễn phí, mà là tự do kiểm soát công nghệ bạn sử dụng.”</p><hr><h2>3. Tiêu chí phần mềm mã nguồn mở (theo OSI)</h2><ol> <li>Phân phối tự do (Free Redistribution).</li> <li>Mã nguồn có sẵn.</li> <li>Cho phép sửa đổi và tạo sản phẩm phái sinh.</li> <li>Không phân biệt người dùng hoặc lĩnh vực sử dụng.</li> <li>Không hạn chế phần mềm khác đi kèm.</li></ol><hr><h2>4. Các loại giấy phép mã nguồn mở</h2><table border=\"1\" cellpadding=\"6\"><thead><tr><th>Giấy phép</th><th>Đặc điểm</th><th>Phạm vi sử dụng</th></tr></thead><tbody><tr><td><b>GPL (GNU General Public License)</b></td><td>Yêu cầu mọi bản phái sinh cũng phải mở nguồn.</td><td>Dự án cộng đồng, học thuật.</td></tr><tr><td><b>LGPL</b></td><td>Cho phép sử dụng trong phần mềm đóng, nhưng giữ phần lõi mở.</td><td>Thư viện và API.</td></tr><tr><td><b>MIT</b></td><td>Rất linh hoạt, cho phép sử dụng thương mại.</td><td>Startups, doanh nghiệp nhỏ.</td></tr><tr><td><b>BSD</b></td><td>Tương tự MIT, đơn giản, dễ tích hợp.</td><td>Hệ thống, framework.</td></tr><tr><td><b>Apache 2.0</b></td><td>Thêm điều khoản bảo vệ bằng sáng chế.</td><td>Doanh nghiệp lớn, sản phẩm thương mại.</td></tr></tbody></table><hr><h2>5. Mô hình phát triển mã nguồn mở</h2><ul> <li><b>Distributed Collaboration:</b> Mọi người đóng góp qua Git, Pull Request, Review Code.</li> <li><b>Meritocracy:</b> Ai đóng góp nhiều, có quyền quyết định cao hơn.</li> <li><b>Transparency:</b> Mọi thay đổi đều công khai, dễ kiểm soát chất lượng.</li></ul><p><b>Ví dụ:</b> Dự án Linux, Apache, PostgreSQL, WordPress, Moodle, Canvas LMS đều dựa trên mô hình này.</p><hr><h2>6. Ứng dụng và tác động xã hội</h2><p>Phần mềm mã nguồn mở hiện diện trong hầu hết lĩnh vực: từ chính phủ điện tử (OpenGov), giáo dục (Moodle, Canvas LMS) đến doanh nghiệp (Linux Server, Kubernetes, Docker).</p><p>OSS giúp giảm chi phí, tăng tính minh bạch, thúc đẩy đổi mới và học tập cộng đồng.</p><hr><h2>🧠 Bài tập thực hành</h2><ol> <li>Liệt kê 5 phần mềm mã nguồn mở đang sử dụng hàng ngày và xác định giấy phép của chúng.</li> <li>Phân tích sự khác biệt giữa GPL và MIT License khi dùng cho sản phẩm thương mại.</li> <li>Tìm một dự án trên GitHub, mô tả cách đóng góp (fork, pull request, issue).</li> <li>Thảo luận: Vì sao chính phủ và giáo dục nên ưu tiên sử dụng OSS?</li></ol><hr><h2>✅ Tổng kết</h2><ul> <li>Mã nguồn mở không chỉ là công nghệ mà còn là triết lý chia sẻ tri thức.</li> <li>Hiểu rõ bản quyền và giấy phép giúp tránh rủi ro pháp lý khi phát triển phần mềm.</li> <li>Các dự án OSS tiêu biểu: Linux, Apache, MySQL, PHP, Python, Docker, Moodle, WordPress.</li></ul>",
  "updated_at": null
}