{
  "id": "lesson_bai-1-tong-quan-ve-bao-mat-thong-tin",
  "title": "lesson_bai-1-tong-quan-ve-bao-mat-thong-tin",
  "body": "<h1>🔐 BÀI 1 – TỔNG QUAN VỀ BẢO MẬT THÔNG TIN</h1><h2>🎯 Mục tiêu</h2><ul><li>Nắm bốn mục tiêu cốt lõi của an toàn thông tin: Confidentiality, Integrity, Availability, Accountability/Non-repudiation.</li><li>Hiểu mô hình đe dọa, bề mặt tấn công và chuỗi tấn công (kill chain).</li><li>Phân loại tấn công theo kỹ thuật, theo lớp OSI, và theo mục tiêu.</li><li>Hiểu vai trò của mật mã học trong bảo mật truyền thông và bảo vệ hệ thống.</li><li>Nắm tổng quan cơ chế kiểm soát: chính sách, con người, quy trình, công nghệ.</li></ul><hr><h2>1. Khái niệm và các nguyên tắc</h2><p><b>Thông tin</b> là tài sản; <b>an toàn thông tin</b> là tập hợp biện pháp bảo vệ tài sản khỏi truy cập, sử dụng, tiết lộ, phá hoại trái phép. Bộ mục tiêu: <b>Confidentiality</b> (chỉ người có quyền được xem), <b>Integrity</b> (dữ liệu không bị thay đổi trái phép), <b>Availability</b> (dịch vụ luôn sẵn sàng), <b>Accountability/Non-repudiation</b> (truy vết và chống chối bỏ).</p><p><b>Nguyên tắc Kerckhoffs</b>: an toàn dựa vào bí mật khóa, không dựa vào bí mật thuật toán; <b>nguyên tắc tối thiểu</b> (least privilege), <b>phòng thủ nhiều lớp</b> (defense in depth), <b>mặc định an toàn</b> (secure by default), <b>giảm bề mặt tấn công</b>, <b>Zero Trust</b>.</p><hr><h2>2. Bảo vệ thông tin trong truyền thông mạng</h2><h3>2.1 Phân loại tấn công</h3><ul><li><b>Thụ động</b>: nghe lén (eavesdropping), phân tích lưu lượng (traffic analysis).</li><li><b>Chủ động</b>: giả mạo (spoofing), xen giữa (MITM), phát lại (replay), thay đổi gói (tampering), từ chối dịch vụ (DoS/DDoS), hạ cấp mã hóa (downgrade), tấn công thời gian (timing) và kênh kề (side-channel).</li></ul><h3>2.2 Kiến trúc an ninh theo OSI</h3><ul><li><b>L2</b>: 802.1X, MACsec; <b>L3</b>: IPsec (AH/ESP); <b>L4–7</b>: TLS/DTLS/SSH, S/MIME, PGP; <b>Ứng dụng</b>: JWT/OAuth2, Kerberos.</li><li><b>Bảo mật đầu cuối</b> (E2E) vs <b>bảo mật điểm-điểm</b>: E2E bảo vệ dữ liệu đến ứng dụng đích; điểm-điểm bảo vệ đoạn đường truyền.</li></ul><h3>2.3 Mô hình an ninh tổng quát</h3><p>Nguồn → Thuật toán/Mã hóa + Khóa → Kênh truyền có nhiễu/tấn công → Giải mã/Xác thực → Đích. Các dịch vụ an ninh: <b>confidentiality</b> (mã hóa), <b>integrity</b> (MAC/Hash + khóa), <b>authentication</b> (chứng thực thực thể, chứng thực thông điệp), <b>non-repudiation</b> (chữ ký số), <b>access control</b>, <b>traffic padding</b>.</p><h3>2.4 Vai trò của mật mã học</h3><ul><li><b>Đối xứng</b> (AES, ChaCha20) cho tốc độ; <b>bất đối xứng</b> (RSA, ECC) cho phân phối khóa/chữ ký; <b>hàm băm</b> (SHA-2/3) bảo toàn toàn vẹn; <b>MAC/HMAC</b> xác thực thông điệp; <b>PRNG/DRBG</b> tạo ngẫu nhiên; <b>PFS</b> với Diffie-Hellman/ECDH.</li><li><b>Quản trị khóa</b>: tạo, phân phối, luân chuyển, thu hồi; HSM, KMS, PKI, chứng chỉ X.509.</li></ul><hr><h2>3. Bảo vệ hệ thống khỏi xâm nhập/phá hoại</h2><ul><li><b>Chính sách &amp; quản trị</b>: phân loại dữ liệu, mô hình quyền (RBAC/ABAC), tuân thủ (ISO 27001, NIST 800-53).</li><li><b>Kiểm soát kỹ thuật</b>: tường lửa, IDS/IPS, WAF, EDR/XDR, sandbox, DLP, anti-malware, anti-phishing, lọc DNS, rate limiting, CAPTCHA, mTLS.</li><li><b>Cứng hóa hệ thống</b>: vá lỗi, tắt dịch vụ thừa, cấu hình bảo mật, ghi nhật ký, SIEM/SOAR.</li><li><b>Quy trình</b>: quản trị bản vá, quản trị thay đổi, sao lưu/khôi phục (3-2-1), BCP/DRP, diễn tập IR (Incident Response) theo các pha: phát hiện → khoanh vùng → xử lý → phục hồi → cải tiến.</li><li><b>Yếu tố con người</b>: đào tạo nhận thức, chống social engineering, MFA, quản lý mật khẩu/secret, kiểm tra nền tảng nhà cung cấp (supply chain).</li></ul><hr><h2>4. Đánh giá rủi ro và mô hình đe dọa</h2><p>Khung STRIDE (Spoofing, Tampering, Repudiation, Information disclosure, Denial of service, Elevation of privilege). Đánh giá rủi ro qua <b>tác động × khả năng xảy ra</b>; áp dụng <b>kiểm soát</b> theo mức ưu tiên; theo dõi bằng KPI/KRI. Sử dụng mô hình dữ liệu DFD kèm luồng tin cậy để xác định điểm cần bảo vệ.</p><hr><h2>5. Nhầm lẫn phổ biến và phản biện</h2><ul><li><b>Mã hóa ≠ bảo mật hoàn toàn</b>: nếu khóa/thiết kế/quy trình yếu, hệ thống vẫn bị khai thác.</li><li><b>1 lớp phòng thủ không đủ</b>: cần defense-in-depth và Zero Trust.</li><li><b>Chứng chỉ không hợp lệ</b> làm suy yếu TLS; <b>đàm phán thuật toán yếu</b> gây tấn công hạ cấp; <b>ngẫu nhiên kém</b> phá vỡ khóa.</li></ul><hr><h2>✅ Tổng kết</h2><ul><li>Bảo mật thông tin là bài toán tổng hợp: công nghệ + quy trình + con người.</li><li>Mật mã học cung cấp nền tảng, nhưng quản trị khóa và vận hành mới quyết định an toàn thực chiến.</li><li>Hiểu kẻ tấn công, mô hình đe dọa và lớp OSI giúp chọn điểm đặt cơ chế bảo vệ tối ưu.</li></ul>",
  "updated_at": null
}