{
  "id": "lesson_bai-5-quan-lu-khoa-dung-ma-khoa-cong-khai",
  "title": "lesson_bai-5-quan-lu-khoa-dung-ma-khoa-cong-khai",
  "body": "<h1>🔑 BÀI 5 – QUẢN LÝ KHÓA DÙNG MÃ KHÓA CÔNG KHAI</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu cơ chế quản lý khóa trong các hệ thống mật mã công khai.</li><li>Nắm được cấu trúc và vai trò của hạ tầng khóa công khai (PKI).</li><li>Biết cách chứng chỉ số (Digital Certificate) hoạt động và được xác minh.</li><li>Hiểu quy trình phát hành, thu hồi, và kiểm tra chứng chỉ qua CRL/OCSP.</li><li>Phân biệt các cấp CA, chính sách và quy trình đảm bảo an toàn khóa.</li></ul><hr><h2>1. TỔNG QUAN VỀ QUẢN LÝ KHÓA</h2><p>Hệ thống mã hóa khóa công khai (Public Key Cryptography) yêu cầu các bên phải có khả năng xác minh khóa công khai thật sự thuộc về đúng chủ thể. Điều này được thực hiện thông qua <b>hạ tầng khóa công khai (PKI)</b>.</p><p>Quản lý khóa bao gồm: tạo, phân phối, lưu trữ, sử dụng, thu hồi và hủy khóa khi hết hạn hoặc bị xâm phạm. Nếu một khóa bị lộ, toàn bộ chuỗi tin cậy có thể bị ảnh hưởng.</p><hr><h2>2. HẠ TẦNG KHÓA CÔNG KHAI (PKI)</h2><p><b>PKI (Public Key Infrastructure)</b> là tập hợp các thành phần phần cứng, phần mềm, chính sách và con người để quản lý khóa công khai và chứng chỉ số.</p><ul><li><b>CA (Certification Authority):</b> Cơ quan chứng thực – cấp và ký chứng chỉ số.</li><li><b>RA (Registration Authority):</b> Cơ quan đăng ký – xác minh danh tính người yêu cầu.</li><li><b>Repository:</b> Kho lưu trữ chứng chỉ và danh sách thu hồi (CRL).</li><li><b>Subscriber:</b> Người sở hữu khóa và chứng chỉ.</li><li><b>Relying Party:</b> Người/ứng dụng tin cậy vào chứng chỉ được cấp.</li></ul><hr><h2>3. CHỨNG CHỈ SỐ (DIGITAL CERTIFICATE)</h2><p><b>Chứng chỉ số</b> là file chứa khóa công khai cùng thông tin định danh và chữ ký số của CA. Chuẩn phổ biến nhất là <b>X.509 v3</b>.</p><p><b>Cấu trúc chứng chỉ X.509:</b></p><ul><li>Phiên bản (Version)</li><li>Số sê-ri (Serial Number)</li><li>Thuật toán ký (Signature Algorithm)</li><li>Thông tin chủ thể (Subject)</li><li>Khóa công khai (Public Key)</li><li>Thời hạn hiệu lực (Validity)</li><li>Thông tin CA phát hành (Issuer)</li><li>Phần mở rộng (Extensions – SAN, Key Usage, CRL Distribution Point, OCSP URL)</li><li>Chữ ký số của CA</li></ul><hr><h2>4. CHUỖI TIN CẬY (CHAIN OF TRUST)</h2><p>Chuỗi tin cậy bắt đầu từ <b>Root CA</b> → <b>Intermediate CA</b> → <b>End-Entity Certificate</b>. Ứng dụng (trình duyệt, hệ điều hành) chỉ cần tin tưởng Root CA; các chứng chỉ trung gian được xác thực theo chuỗi chữ ký.</p><p><b>Root CA</b> thường được cài sẵn trong hệ thống (trusted store) và được bảo vệ nghiêm ngặt, thường offline.</p><hr><h2>5. THU HỒI VÀ KIỂM TRA TRẠNG THÁI CHỨNG CHỈ</h2><ul><li><b>CRL (Certificate Revocation List):</b> Danh sách chứng chỉ bị thu hồi, do CA phát hành định kỳ.</li><li><b>OCSP (Online Certificate Status Protocol):</b> Giao thức trực tuyến giúp kiểm tra trạng thái chứng chỉ theo thời gian thực.</li><li><b>OCSP Stapling:</b> Máy chủ đính kèm phản hồi OCSP vào quá trình handshake TLS để giảm tải cho CA.</li></ul><p>Nguyên nhân thu hồi chứng chỉ: khóa bí mật bị lộ, chủ thể không còn hợp lệ, hoặc CA phát hiện sai phạm trong phát hành.</p><hr><h2>6. VÒNG ĐỜI KHÓA VÀ CHỨNG CHỈ</h2><ol><li>Tạo cặp khóa (RSA/ECC) và yêu cầu cấp chứng chỉ (CSR).</li><li>CA xác minh danh tính qua RA.</li><li>Phát hành chứng chỉ và công bố lên repository.</li><li>Gia hạn hoặc thu hồi khi cần.</li><li>Hủy hoặc thay thế khóa khi hết hạn.</li></ol><hr><h2>7. CHÍNH SÁCH VÀ AN TOÀN KHÓA</h2><ul><li><b>Key Policy:</b> định nghĩa độ dài khóa tối thiểu, thuật toán, và thời hạn hiệu lực.</li><li><b>Key Escrow:</b> lưu trữ bản sao khóa trong môi trường an toàn (HSM) cho mục đích khôi phục.</li><li><b>Key Backup:</b> sao lưu khóa bí mật được mã hóa bằng khóa master.</li><li><b>Key Rotation:</b> thay khóa định kỳ để giảm thiểu rủi ro bị lộ.</li><li><b>HSM (Hardware Security Module):</b> thiết bị phần cứng bảo vệ khóa, chống truy cập trái phép.</li></ul><hr><h2>8. ỨNG DỤNG PKI</h2><ul><li>HTTPS (TLS): xác thực máy chủ qua chứng chỉ X.509.</li><li>VPN (IPsec, SSL-VPN): xác thực điểm cuối.</li><li>Email bảo mật (S/MIME): ký và mã hóa thư.</li><li>Chữ ký điện tử: xác thực pháp lý tài liệu.</li></ul><hr><h2>✅ TỔNG KẾT</h2><ul><li>PKI là nền tảng của niềm tin số trong các hệ thống hiện đại.</li><li>CA, RA, CRL, OCSP và chính sách khóa đảm bảo tính xác thực và an toàn dữ liệu.</li><li>Quản lý khóa đúng quy trình giúp duy trì tính toàn vẹn và tránh sụp đổ chuỗi tin cậy.</li></ul>",
  "updated_at": null
}