{
  "id": "lesson_bai-09-data-binding-trong-windows-form",
  "title": "lesson_bai-09-data-binding-trong-windows-form",
  "body": "<h1>🧩 BÀI 09 – DATA BINDING TRONG WINDOWS FORM</h1><h2>🎯 Mục tiêu học tập</h2><ul>  <li>Hiểu khái niệm và cơ chế hoạt động của Data Binding trong Windows Forms.</li>  <li>Phân biệt Simple Binding và Complex Binding.</li>  <li>Thực hành ràng buộc dữ liệu giữa các control và nguồn dữ liệu.</li>  <li>Biết cách sử dụng BindingSource, BindingContext và xử lý cập nhật dữ liệu hai chiều.</li>  <li>Giải quyết lỗi thường gặp trong quá trình binding dữ liệu.</li></ul><hr><h2>1. Giới thiệu Data Binding</h2><p><b>Data Binding</b> là cơ chế cho phép control hiển thị và cập nhật dữ liệu trực tiếp từ nguồn (DataTable, List, Object).</p><p>Ưu điểm:</p><ul>  <li>Giảm code xử lý thủ công.</li>  <li>Tự động đồng bộ dữ liệu giữa giao diện và model.</li>  <li>Dễ mở rộng và bảo trì ứng dụng.</li></ul><hr><h2>2. Simple Data Binding</h2><p>Liên kết một control với một giá trị dữ liệu đơn lẻ.</p><pre><code>txtName.DataBindings.Add(\"Text\", dtSinhVien, \"HoTen\");chkGender.DataBindings.Add(\"Checked\", dtSinhVien, \"GioiTinh\");</code></pre><p>Khi dữ liệu trong DataTable thay đổi, TextBox tự động cập nhật.</p><hr><h2>3. Complex Data Binding</h2><p>Dùng cho control có thể hiển thị nhiều bản ghi (DataGridView, ComboBox, ListBox).</p><pre><code>comboBox1.DataSource = dtLop;comboBox1.DisplayMember = \"TenLop\";comboBox1.ValueMember = \"MaLop\";dataGridView1.DataSource = dtSinhVien;</code></pre><p><b>DisplayMember</b>: cột hiển thị ra màn hình.<br><b>ValueMember</b>: giá trị nội bộ được sử dụng.</p><hr><h2>4. BindingSource – lớp trung gian giữa dữ liệu và control</h2><p><b>BindingSource</b> giúp quản lý đồng bộ nhiều control cùng ràng buộc tới cùng nguồn dữ liệu.</p><pre><code>BindingSource bs = new BindingSource();bs.DataSource = dtSinhVien;txtID.DataBindings.Add(\"Text\", bs, \"MaSV\");txtName.DataBindings.Add(\"Text\", bs, \"HoTen\");dataGridView1.DataSource = bs;</code></pre><p>✅ Khi chọn dòng khác trên DataGridView, dữ liệu trong TextBox cũng thay đổi theo.</p><hr><h2>5. Cập nhật dữ liệu hai chiều</h2><p>Binding trong Windows Form mặc định là <b>two-way</b> — thay đổi ở control hoặc ở nguồn dữ liệu đều được đồng bộ hóa.</p><pre><code>txtName.DataBindings[\"Text\"].WriteValue(); // Ghi ngược về nguồn dữ liệu</code></pre><hr><h2>6. Quản lý BindingContext</h2><p><b>BindingContext</b> quản lý nhóm ràng buộc. Mỗi Form hoặc container có thể có một BindingContext riêng.</p><pre><code>this.BindingContext[bs].Position = 0; // Chuyển con trỏ về bản ghi đầu tiên</code></pre><hr><h2>7. Xử lý lỗi và sự kiện Data Binding</h2><p>Các sự kiện quan trọng:</p><ul>  <li><b>Format</b> – xử lý định dạng hiển thị.</li>  <li><b>Parse</b> – xử lý khi người dùng thay đổi dữ liệu.</li>  <li><b>BindingComplete</b> – hoàn tất ràng buộc.</li></ul><pre><code>txtName.DataBindings[\"Text\"].Format += (s, e) =&gt; {    e.Value = e.Value.ToString().ToUpper();};</code></pre><hr><h2>🧠 Bài tập thực hành</h2><ol>  <li>Tạo Form hiển thị danh sách sinh viên bằng DataGridView.</li>  <li>Thêm TextBox để hiển thị chi tiết thông tin sinh viên (DataBinding).</li>  <li>Thực hiện cập nhật dữ liệu trực tiếp từ TextBox và lưu về DataTable.</li>  <li>Thêm ComboBox hiển thị lớp học và ràng buộc với bảng Lop.</li></ol><hr><h2>✅ Tổng kết</h2><ul>  <li>Data Binding giúp giảm code xử lý dữ liệu thủ công.</li>  <li>Simple Binding dùng cho control đơn, Complex Binding dùng cho danh sách.</li>  <li>BindingSource giúp quản lý nhiều control cùng nguồn dữ liệu.</li>  <li>BindingContext điều khiển con trỏ dữ liệu trong Form.</li>  <li>Sự kiện Format/Parse hỗ trợ kiểm soát luồng dữ liệu hiển thị.</li></ul>",
  "updated_at": null
}