{
  "id": "lesson_bai-01-tong-quan-ve-co-so-du-lieu",
  "title": "lesson_bai-01-tong-quan-ve-co-so-du-lieu",
  "body": "<h1>🧩 BÀI 01 – TỔNG QUAN VỀ CƠ SỞ DỮ LIỆU</h1> <h2>🎯 Mục tiêu học tập</h2> <ul> <li>Hiểu rõ khái niệm cơ sở dữ liệu và vai trò của hệ quản trị cơ sở dữ liệu (DBMS).</li> <li>Phân biệt được dữ liệu, thông tin và tri thức trong môi trường tổ chức.</li> <li>Trình bày được các loại mô hình dữ liệu phổ biến và ứng dụng của từng loại.</li> <li>Phân tích được cấu trúc và chức năng của một hệ quản trị CSDL hiện đại.</li> </ul> <hr> <h2>1. HỆ CƠ SỞ DỮ LIỆU</h2> <h3>1.1 Định nghĩa</h3> <p>Cơ sở dữ liệu (CSDL – Database) là tập hợp có tổ chức của dữ liệu liên quan đến nhau, được lưu trữ và quản lý bởi hệ quản trị cơ sở dữ liệu (DBMS). Mục tiêu là đảm bảo tính nhất quán, toàn vẹn, bảo mật và khả năng truy xuất nhanh chóng cho người dùng.</p> <h3>1.2 Các mô biểu diễn CSDL</h3> <p>Ba cấp độ biểu diễn dữ liệu trong kiến trúc ba lớp: <b>mức vật lý</b> (cách dữ liệu được lưu trữ thật), <b>mức logic</b> (mối quan hệ giữa các bảng, khóa, thuộc tính) và <b>mức khung nhìn</b> (giao diện người dùng). Cách tiếp cận này giúp tách biệt độc lập giữa cấu trúc lưu trữ và cách truy xuất dữ liệu.</p> <h3>1.3 Đặc tính môi trường CSDL</h3> <ul> <li>Tính chia sẻ và không trùng lặp dữ liệu.</li> <li>Tính toàn vẹn, bảo mật và truy cập đồng thời.</li> <li>Khả năng phục hồi sau sự cố (crash recovery) và sao lưu.</li> </ul> <hr> <h2>2. HỆ QUẢN TRỊ CƠ SỞ DỮ LIỆU (DBMS)</h2> <h3>2.1 Khái niệm</h3> <p>DBMS là phần mềm trung gian giữa người dùng và cơ sở dữ liệu, cung cấp các chức năng lưu trữ, truy vấn, bảo mật, kiểm soát truy cập, và tối ưu hóa hiệu năng. Ví dụ: Oracle, MySQL, SQL Server, PostgreSQL.</p> <h3>2.2 Thành phần của DBMS</h3> <ul> <li><b>Data Definition Language (DDL):</b> dùng để định nghĩa cấu trúc dữ liệu.</li> <li><b>Data Manipulation Language (DML):</b> dùng để truy xuất và thay đổi dữ liệu.</li> <li><b>Query Processor:</b> bộ xử lý truy vấn tối ưu hóa SQL.</li> <li><b>Transaction Manager:</b> quản lý giao dịch đảm bảo ACID (Atomicity, Consistency, Isolation, Durability).</li> <li><b>Storage Manager:</b> điều phối lưu trữ vật lý và bộ nhớ đệm.</li> </ul> <hr> <h2>3. CÁC LOẠI MÔ HÌNH DỮ LIỆU</h2> <h3>3.1 Mô hình phân cấp (Hierarchical Model)</h3> <p>Tổ chức dữ liệu theo cấu trúc cây, mỗi nút cha có thể có nhiều nút con. Nhược điểm: khó biểu diễn mối quan hệ nhiều-nhiều.</p> <h3>3.2 Mô hình mạng (Network Model)</h3> <p>Cho phép mỗi bản ghi có nhiều liên kết, sử dụng con trỏ để quản lý quan hệ phức tạp. Ví dụ: IDMS, CODASYL.</p> <h3>3.3 Mô hình quan hệ (Relational Model)</h3> <p>Đề xuất bởi E.F. Codd (1970), dữ liệu được biểu diễn bằng bảng (relation) với hàng (tuple) và cột (attribute). Đây là mô hình phổ biến nhất hiện nay, cơ sở của SQL.</p> <h3>3.4 Mô hình hướng đối tượng (Object-Oriented Model)</h3> <p>Kết hợp tính đóng gói, kế thừa, đa hình; thích hợp cho ứng dụng phức tạp như CAD, multimedia.</p> <h3>3.5 Mô hình quan hệ-hướng đối tượng</h3> <p>Là sự kết hợp giữa mô hình quan hệ và hướng đối tượng, cho phép lưu trữ kiểu dữ liệu phức hợp (object type, collection).</p> <hr> <h2>✅ TỔNG KẾT</h2> <ul> <li>CSDL giúp quản lý và truy xuất dữ liệu hiệu quả trong môi trường đa người dùng.</li> <li>DBMS đóng vai trò trung tâm, đảm bảo tính toàn vẹn, bảo mật và tối ưu truy vấn.</li> <li>Mô hình quan hệ là nền tảng phổ biến nhất, sử dụng ngôn ngữ SQL làm công cụ chuẩn.</li> </ul> <hr> <h2>📘 TÀI LIỆU THAM KHẢO</h2> <ul> <li>Database System Concepts – Silberschatz, Korth &amp; Sudarshan.</li> <li>Fundamentals of Database Systems – Elmasri &amp; Navathe.</li> <li>SQL for Data Analysis – Google Data Engineering Handbook.</li> </ul>",
  "updated_at": null
}