{
  "title": "BÀI 1 – TỔNG QUAN VỀ MẠNG",
  "created_at": "2025-10-25T10:29:35Z",
  "url": "bai-1-tong-quan-ve-mang",
  "editing_roles": "teachers",
  "page_id": 273,
  "last_edited_by": {
    "id": 1,
    "anonymous_id": "1",
    "display_name": "admin@gmail.com",
    "avatar_image_url": "http://localhost:3000/images/messages/avatar-50.png",
    "html_url": "http://localhost:3000/courses/4/users/1",
    "pronouns": null
  },
  "published": true,
  "hide_from_students": false,
  "front_page": false,
  "html_url": "http://localhost:3000/courses/4/pages/bai-1-tong-quan-ve-mang",
  "todo_date": null,
  "publish_at": null,
  "updated_at": "2025-10-25T10:29:55Z",
  "locked_for_user": false,
  "body": "<h1>🌐 BÀI 1 – TỔNG QUAN VỀ MẠNG MÁY TÍNH</h1><h2>1.1 ẢNH HƯỞNG CỦA MẠNG TRONG ĐỜI SỐNG</h2><p>Mạng máy tính đóng vai trò trung tâm trong hầu hết các hoạt động hiện đại – từ giao tiếp, học tập, giải trí đến quản lý doanh nghiệp. Công nghệ mạng đã thay đổi cách con người chia sẻ dữ liệu, làm việc cộng tác và kết nối toàn cầu. Các dịch vụ như email, mạng xã hội, điện toán đám mây, thương mại điện tử hay IoT đều phụ thuộc vào hệ thống mạng.</p><h2>1.2 CÁC THÀNH PHẦN TRONG MẠNG</h2><ul><li><b>Các host:</b> Là các thiết bị đầu cuối như máy tính, điện thoại, máy chủ. Host chịu trách nhiệm khởi tạo, xử lý và nhận dữ liệu.</li><li><b>Peer-to-peer (P2P):</b> Mô hình kết nối ngang hàng, nơi mỗi máy vừa là client vừa là server, chia sẻ tài nguyên trực tiếp mà không cần máy chủ trung tâm.</li><li><b>Thiết bị đầu cuối:</b> Gồm PC, laptop, thiết bị IoT, router, smartphone... giao tiếp qua card mạng (NIC).</li><li><b>Thiết bị mạng trung gian:</b> Router, switch, hub, access point – đóng vai trò định tuyến, chuyển mạch và phân phối dữ liệu.</li><li><b>Truyền thông trên mạng:</b> Quá trình gói tin được mã hóa, chia nhỏ, định tuyến và truyền qua các liên kết vật lý hoặc không dây.</li></ul><h2>1.3 CÁC TOPOLOGY (CẤU TRÚC MẠNG)</h2><p>Topology xác định cách các thiết bị được kết nối vật lý hoặc logic trong mạng:</p><ul><li><b>Bus topology:</b> Dạng tuyến tính, các node chia sẻ cùng một đường truyền – dễ thiết lập nhưng khó mở rộng.</li><li><b>Star topology:</b> Mỗi node kết nối với thiết bị trung tâm (hub/switch) – phổ biến nhờ dễ quản lý.</li><li><b>Ring topology:</b> Các node nối thành vòng khép kín, dữ liệu truyền một chiều.</li><li><b>Mesh topology:</b> Mỗi node kết nối trực tiếp với nhiều node khác – độ tin cậy cao, chi phí lớn.</li><li><b>Hybrid topology:</b> Kết hợp nhiều dạng khác nhau để tận dụng ưu điểm của từng mô hình.</li></ul><h2>1.4 CÁC LOẠI MẠNG THÔNG THƯỜNG</h2><ul><li><b>PAN (Personal Area Network):</b> Mạng cá nhân với phạm vi vài mét – dùng cho thiết bị Bluetooth, IoT.</li><li><b>LAN (Local Area Network):</b> Mạng cục bộ trong phạm vi nhỏ – thường dùng trong văn phòng, trường học.</li><li><b>WAN (Wide Area Network):</b> Mạng diện rộng – kết nối nhiều LAN qua đường truyền viễn thông, ví dụ Internet.</li><li><b>Intranet:</b> Hệ thống mạng nội bộ chỉ cho phép truy cập trong tổ chức.</li><li><b>Extranet:</b> Mở rộng Intranet cho đối tác bên ngoài, vẫn được kiểm soát bảo mật.</li></ul><h2>1.5 KẾT NỐI INTERNET</h2><ul><li><b>Kỹ thuật truy cập Internet:</b> Bao gồm Dial-up, DSL, cáp quang, 4G/5G, vệ tinh.</li><li><b>Home/Small Office:</b> Sử dụng modem hoặc router Wi-Fi để chia sẻ kết nối.</li><li><b>Doanh nghiệp:</b> Dùng leased line, VPN hoặc MPLS để đảm bảo băng thông và bảo mật.</li><li><b>Mạng hội tụ:</b> Tích hợp dữ liệu, thoại, video trên cùng hạ tầng IP duy nhất.</li></ul><h2>1.6 MẠNG TIN CẬY</h2><ul><li><b>Khả năng chịu lỗi:</b> Hệ thống có thể tiếp tục hoạt động khi một thành phần gặp sự cố (fault-tolerance).</li><li><b>Khả năng mở rộng:</b> Mạng có thể mở rộng số lượng node và dung lượng mà không ảnh hưởng hiệu năng.</li><li><b>Chất lượng dịch vụ (QoS):</b> Cơ chế ưu tiên lưu lượng quan trọng như thoại/video so với dữ liệu nền.</li><li><b>Bảo mật:</b> Sử dụng tường lửa, mã hóa, VPN, IDS/IPS để đảm bảo tính toàn vẹn, bí mật và sẵn sàng.</li><li><b>Xu hướng gần đây:</b> IoT, Cloud, SDN (Software-Defined Networking), ảo hóa mạng (NFV) và 5G.</li><li><b>Cộng tác &amp; điện toán đám mây:</b> Google Workspace, Microsoft 365 minh họa cho xu hướng làm việc từ xa qua hạ tầng mạng.</li></ul><h2>1.7 BẢO MẬT MẠNG</h2><ul><li><b>Mối đe dọa an ninh:</b> Tấn công từ chối dịch vụ (DDoS), giả mạo địa chỉ (spoofing), nghe lén (sniffing), malware, ransomware.</li><li><b>Giải pháp bảo mật:</b> Xác thực đa yếu tố (MFA), tường lửa lớp ứng dụng, mã hóa đầu-cuối, kiểm soát truy cập và đào tạo nhận thức người dùng.</li></ul><h3>Tổng kết</h3><p>Bài học cung cấp nền tảng hiểu biết toàn diện về cấu trúc, phân loại, và cơ chế hoạt động của mạng máy tính – nền tảng để học các tầng OSI và kỹ thuật cấu hình thiết bị mạng ở các bài tiếp theo.</p>"
}