{
  "id": "lesson_bai-1-phan-tich-va-thiet-ke-mo-hinh-du-lieu",
  "title": "lesson_bai-1-phan-tich-va-thiet-ke-mo-hinh-du-lieu",
  "body": "<h1>📘 BÀI 1 – PHÂN TÍCH VÀ THIẾT KẾ MÔ HÌNH DỮ LIỆU</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Nắm vững khái niệm lõi về hệ cơ sở dữ liệu, các mức biểu diễn và vai trò của thiết kế dữ liệu.</li><li>Hiểu đầy đủ mô hình Thực thể–Kết hợp (ER/MKH): thực thể, thuộc tính, khóa, ràng buộc bội số và tham gia.</li><li>Vận dụng mô hình ER mở rộng (EER): thực thể yếu, tổng quát hóa/chuyên biệt hóa, kế thừa thuộc tính, phân hoạch chồng lấp và toàn phần, kết hợp bậc cao, kết tập (aggregation).</li><li>Biết cách chuyển mô hình ER/EER sang mô hình quan hệ đúng ràng buộc.</li></ul><hr><h2>1.1 CÁC KHÁI NIỆM CƠ SỞ</h2><h3>1.1.1 Định nghĩa hệ CSDL</h3><p>Hệ cơ sở dữ liệu (DBS) gồm CSDL (dữ liệu có cấu trúc, nhất quán), Hệ QTCSDL (DBMS) và các ứng dụng. Mục tiêu: loại bỏ dư thừa, đảm bảo toàn vẹn, đồng thời và bảo mật, phục vụ truy vấn hiệu quả.</p><h3>1.1.2 Các mức biểu diễn CSDL</h3><ul><li><b>Mức khái niệm (Conceptual/Logical-independent):</b> Mô tả <i>những gì</i> hệ thống lưu (thực thể, thuộc tính, kết hợp, ràng buộc). Công cụ: ER/EER.</li><li><b>Mức logic cài đặt (Logical/Relational):</b> Lược đồ quan hệ, khóa, phụ thuộc hàm, chuẩn hóa, chỉ mục, view, trigger.</li><li><b>Mức vật lý (Physical/Internal):</b> Tổ chức file, trang, chỉ mục B+-tree, heap/clustered, phân vùng, nén, buffer pool.</li></ul><h3>1.1.3 Đặc tính của môi trường CSDL</h3><ul><li><b>Toàn vẹn:</b> khóa chính, khóa ngoại, ràng buộc miền, ràng buộc nghiệp vụ.</li><li><b>Đồng thời và cách ly:</b> giao dịch, mức cách ly, khóa và kiểm soát tranh chấp.</li><li><b>An toàn và phục hồi:</b> quyền, audit, mã hóa, WAL, backup/restore.</li><li><b>Hiệu năng:</b> tối ưu truy vấn, thống kê, kế hoạch thực thi, cache.</li></ul><hr><h2>1.2 MÔ HÌNH THỰC THỂ KẾT HỢP (ER/MKH)</h2><h3>1.2.1 Thực thể (Entity) và loại thực thể (Entity Type)</h3><p>Thực thể là đối tượng phân biệt được. Loại thực thể là tập các thực thể cùng thuộc tính. Thuộc tính có thể đơn, tổng hợp, dẫn xuất, nhiều trị; miền giá trị xác định rõ ràng.</p><h3>1.2.2 Mối kết hợp (Relationship)</h3><p>Liên kết giữa các thực thể. Bội số (cardinality) cơ bản: 1–1, 1–N, N–M. <i>Participation</i> có thể toàn phần (total) hoặc bộ phận (partial). Thuộc tính kết hợp dùng khi thuộc tính thuộc về chính mối quan hệ (ví dụ: <i>VaiTro</i> của Giảng viên trong Lớp).</p><h3>1.2.3 Khóa và nhận dạng</h3><ul><li><b>Khóa ứng viên:</b> tập tối thiểu thuộc tính phân biệt thực thể.</li><li><b>Khóa chính:</b> một khóa ứng viên được chọn làm định danh chính.</li><li><b>Khóa thay thế:</b> các khóa ứng viên còn lại.</li></ul><h3>1.2.4 Ràng buộc nghiệp vụ</h3><ul><li><b>Participation:</b> Ví dụ một Lớp <i>phải</i> có ít nhất một Môn học (total participation của Lớp trong dạy).</li><li><b>Cardinality:</b> Mỗi SinhVien thuộc <i>một</i> Khoa (1–N), nhưng Môn–SinhVien là N–M.</li><li><b>Ràng buộc thuộc tính:</b> điểm trong [0,10], ngày kết thúc ≥ ngày bắt đầu.</li></ul><h3>1.2.5 Quy tắc chuyển ER sang quan hệ</h3><ul><li><b>Thực thể mạnh:</b> thành bảng, khóa chính là khóa của thực thể.</li><li><b>Thuộc tính nhiều trị:</b> tách bảng phụ với FK về thực thể gốc, PK = khóa gốc + thuộc tính.</li><li><b>Quan hệ 1–N:</b> thêm FK ở phía N, xét participation để đặt NOT NULL và ràng buộc duy nhất nếu 1–1.</li><li><b>Quan hệ N–M:</b> tạo bảng kết hợp có khóa chính ghép các FK; thuộc tính kết hợp nằm tại bảng này.</li></ul><hr><h2>1.3 MÔ HÌNH THỰC THỂ KẾT HỢP MỞ RỘNG (EER)</h2><h3>1.3.1 Thực thể yếu (Weak Entity)</h3><p>Không có khóa riêng; nhận dạng bởi khóa của chủ thể và <i>discriminator</i>. Khi chuyển sang quan hệ, khóa chính = khóa chủ thể + định danh yếu; FK tới chủ thể là NOT NULL và ON DELETE CASCADE khi phù hợp.</p><h3>1.3.2 Tổng quát hóa/Chuyên biệt hóa (Generalization/Specialization)</h3><ul><li><b>ISA</b>: một thực thể lớp con kế thừa khóa và thuộc tính của lớp cha.</li><li><b>Ràng buộc phân hoạch:</b> <i>Disjoint</i> (phân đôi) hoặc <i>Overlapping</i> (chồng lấp).</li><li><b>Ràng buộc bao phủ:</b> <i>Total</i> (mọi thực thể lớp cha đều thuộc ít nhất một lớp con) hoặc <i>Partial</i>.</li></ul><p>Mô hình quan hệ tương ứng: ba chiến lược chính – <i>Single Table Inheritance</i> (một bảng + cột loại), <i>Class Table</i> (mỗi lớp một bảng, FK tới cha), <i>Concrete Table</i> (chỉ lớp con, sao chép thuộc tính cha).</p><h3>1.3.3 Kết hợp bậc cao và kết tập (N-ary, Aggregation)</h3><p>Khi một kết hợp tham gia như một <i>thực thể</i> của kết hợp khác, dùng <b>aggregation</b> để giữ ngữ nghĩa. Kết hợp bậc-3 trở lên chuyển sang quan hệ có khóa ghép n FK.</p><h3>1.3.4 Quy tắc kiểm chứng mô hình</h3><ul><li>Không để thuộc tính lặp, đa trị chưa chuẩn hóa.</li><li>Ràng buộc bội số và tham gia phải ánh xạ thành FK, NOT NULL, UNIQUE, CHECK, hoặc bảng kết hợp.</li><li>Chọn chiến lược kế thừa nhất quán với yêu cầu truy vấn và cập nhật.</li></ul><hr><h2>Ví dụ ngắn</h2><p>Bài toán đăng ký học: <i>SinhVien(MSSV, HoTen, NgaySinh), MonHoc(MaMon, Ten, SoTC), Lop(MaLop, MaMon, HocKy), ĐK(SinhVien–Lop, ThuocTinh: Diem, LanThi)</i>. Phép ánh xạ: bảng ĐK có PK(MSSV, MaLop) và thuộc tính Diem, LanThi; FK(MSSV) tham chiếu SinhVien, FK(MaLop) tham chiếu Lop; CHECK Diem BETWEEN 0 AND 10.</p><hr><h2>✅ Ghi nhớ nhanh</h2><ul><li>ER mô tả <i>nghiệp vụ</i>; quan hệ cài đặt <i>dữ liệu</i>.</li><li>Bội số và tham gia quyết định nơi đặt FK hoặc tạo bảng kết hợp.</li><li>EER thêm thực thể yếu, kế thừa, kết tập để mô hình hóa chính xác hơn.</li></ul>",
  "updated_at": null
}