{
  "id": "lesson_bai-10-mot-so-kien-thuc-nang-cao",
  "title": "lesson_bai-10-mot-so-kien-thuc-nang-cao",
  "body": "<h1>📙 BÀI 10 – MỘT SỐ KIẾN THỨC NÂNG CAO</h1><h2>🎯 Mục tiêu học tập</h2><ul><li>Hiểu các khái niệm nâng cao trong quản trị cơ sở dữ liệu như con trỏ (cursor), mã hóa dữ liệu, và bảo mật người dùng.</li><li>Biết cách sử dụng con trỏ để xử lý dữ liệu từng dòng.</li><li>Nắm được cơ chế mã hóa dữ liệu trong SQL Server nhằm tăng tính an toàn.</li><li>Hiểu các phương pháp bảo mật, phân quyền và quản trị hiệu năng hệ thống CSDL.</li></ul><hr><h2>10.1 CON TRỎ (CURSOR)</h2><p><b>Cursor</b> là một cơ chế cho phép duyệt qua từng dòng dữ liệu trong tập kết quả truy vấn. Nó được sử dụng khi cần thao tác từng bản ghi riêng biệt thay vì xử lý toàn bộ tập dữ liệu cùng lúc.</p><h3>10.1.1 Cú pháp khai báo và sử dụng Cursor</h3><pre>DECLARE TenCursor CURSOR FOR<br>SELECT MaSV, Diem FROM KetQua;<br>OPEN TenCursor;<br>FETCH NEXT FROM TenCursor INTO @MaSV, @Diem;<br>WHILE @@FETCH_STATUS = 0<br>BEGIN<br>    PRINT @MaSV + ' - ' + CAST(@Diem AS NVARCHAR(10));<br>    FETCH NEXT FROM TenCursor INTO @MaSV, @Diem;<br>END;<br>CLOSE TenCursor;<br>DEALLOCATE TenCursor;</pre><p><b>Lưu ý:</b> Cursor giúp xử lý logic phức tạp nhưng làm giảm hiệu năng khi thao tác với tập dữ liệu lớn.</p><hr><h2>10.2 MÃ HÓA DỮ LIỆU (DATA ENCRYPTION)</h2><h3>10.2.1 Khái niệm</h3><p>Mã hóa dữ liệu là quá trình chuyển đổi thông tin gốc thành dạng không thể đọc được nếu không có khóa giải mã, giúp bảo vệ dữ liệu nhạy cảm như mật khẩu, số tài khoản, hoặc thông tin cá nhân.</p><h3>10.2.2 Các hình thức mã hóa trong SQL Server</h3><ul><li><b>Column Encryption:</b> Mã hóa từng cột dữ liệu cụ thể.</li><li><b>Transparent Data Encryption (TDE):</b> Mã hóa toàn bộ cơ sở dữ liệu ở cấp độ file vật lý.</li><li><b>Always Encrypted:</b> Mã hóa dữ liệu ngay từ phía client, không ai (kể cả DBA) đọc được dữ liệu gốc.</li></ul><h3>10.2.3 Ví dụ mã hóa bằng hàm</h3><pre>-- Mã hóa và giải mã bằng hàm built-in<br>SELECT EncryptByPassPhrase('KeyDemo','Hello World');<br>SELECT CONVERT(varchar, DecryptByPassPhrase('KeyDemo', ));</pre><hr><h2>10.3 BẢO MẬT VÀ PHÂN QUYỀN</h2><h3>10.3.1 Khái niệm</h3><p>Phân quyền trong cơ sở dữ liệu giúp đảm bảo rằng mỗi người dùng chỉ được phép thực hiện những thao tác cần thiết, tránh truy cập trái phép hoặc phá hoại dữ liệu.</p><h3>10.3.2 Các loại quyền trong SQL Server</h3><ul><li><b>GRANT:</b> Cấp quyền cho người dùng.</li><li><b>REVOKE:</b> Thu hồi quyền đã cấp.</li><li><b>DENY:</b> Từ chối quyền, kể cả khi được kế thừa từ nhóm người dùng.</li></ul><h3>10.3.3 Ví dụ phân quyền</h3><pre>GRANT SELECT, INSERT ON SinhVien TO UserA;<br>DENY DELETE ON SinhVien TO UserA;</pre><h3>10.3.4 Quản lý người dùng và vai trò</h3><p>Người quản trị có thể tạo <b>Role</b> (vai trò) để gom nhóm quyền cho nhiều người dùng:</p><pre>CREATE ROLE Role_QLSV;<br>GRANT SELECT, UPDATE ON SinhVien TO Role_QLSV;<br>EXEC sp_addrolemember 'Role_QLSV', 'UserA';</pre><hr><h2>10.4 GIÁM SÁT VÀ TỐI ƯU HIỆU NĂNG</h2><ul><li>Sử dụng công cụ <b>SQL Profiler</b> để theo dõi truy vấn chạy chậm.</li><li>Phân tích kế hoạch thực thi (Execution Plan) để phát hiện điểm nghẽn hiệu năng.</li><li>Tối ưu chỉ mục (Index), tránh sử dụng Cursor nếu có thể.</li><li>Dọn dẹp log và tái tổ chức bảng định kỳ.</li></ul><hr><h2>✅ Ghi nhớ nhanh</h2><ul><li>Cursor dùng để xử lý từng dòng dữ liệu nhưng có thể chậm.</li><li>Mã hóa giúp bảo vệ dữ liệu nhạy cảm khỏi truy cập trái phép.</li><li>Phân quyền giúp kiểm soát người dùng hiệu quả.</li><li>Giám sát và tối ưu hóa giúp đảm bảo hiệu năng lâu dài cho hệ thống.</li></ul>",
  "updated_at": null
}